{
  "token2id": {
    "<UNK>": 0,
    "azumarill": 1,
    "gholdengo": 2,
    "latios": 3,
    "zamazenta-*": 4,
    "corviknight": 5,
    "clodsire": 6,
    "zamazenta": 7,
    "tyranitar": 8,
    "kartana": 9,
    "diancie": 10,
    "excadrill": 11,
    "sinistcha-masterpiece": 12,
    "kommo-o": 13,
    "landorus-therian": 14,
    "tornadus-therian": 15,
    "greninja-*": 16,
    "ogerpon-cornerstone": 17,
    "blaziken": 18,
    "serperior": 19,
    "greninja": 20,
    "mamoswine": 21,
    "cinderace": 22,
    "raging bolt": 23,
    "enamorus-therian": 24,
    "kingambit": 25,
    "swampert": 26,
    "mimikyu": 27,
    "kyurem": 28,
    "garganacl": 29,
    "politoed": 30,
    "ferrothorn": 31,
    "goodra-hisui": 32,
    "ceruledge": 33,
    "cyclizar": 34,
    "weezing-galar": 35,
    "umbreon": 36,
    "glimmora": 37,
    "zapdos-galar": 38,
    "basculegion-f": 39,
    "great tusk": 40,
    "blacephalon": 41,
    "latios-mega": 42,
    "alomomola": 43,
    "mandibuzz": 44,
    "ogerpon-wellspring": 45,
    "slowbro": 46,
    "slowking-galar": 47,
    "scizor": 48,
    "scizor-mega": 49,
    "medicham": 50,
    "zapdos": 51,
    "ting-lu": 52,
    "volcarona": 53,
    "medicham-mega": 54,
    "diancie-mega": 55,
    "indeedee": 56,
    "pelipper": 57,
    "gallade": 58,
    "sinistcha": 59,
    "tapu lele": 60,
    "iron treads": 61,
    "ninetales-alola": 62,
    "ursaluna": 63,
    "hatterene": 64,
    "cresselia": 65,
    "porygon2": 66,
    "mawile": 67,
    "marowak-alola": 68,
    "aegislash": 69,
    "hydreigon": 70,
    "venusaur": 71,
    "gliscor": 72,
    "aerodactyl": 73,
    "latias": 74,
    "samurott-hisui": 75,
    "heliolisk": 76,
    "iron jugulis": 77,
    "iron leaves": 78,
    "tapu koko": 79,
    "charizard": 80,
    "iron hands": 81,
    "iron crown": 82,
    "rillaboom": 83,
    "slowking": 84,
    "moltres": 85,
    "iron valiant": 86,
    "toxapex": 87,
    "pinsir": 88,
    "melmetal": 89,
    "terapagos": 90,
    "clefable": 91,
    "absol": 92,
    "heatran": 93,
    "staraptor": 94,
    "tapu fini": 95,
    "absol-mega": 96,
    "aerodactyl-mega": 97,
    "urshifu-*": 98,
    "empoleon": 99,
    "banette": 100,
    "charizard-mega-y": 101,
    "lopunny": 102,
    "gallade-mega": 103,
    "blissey": 104,
    "terapagos-terastal": 105,
    "urshifu-rapid-strike": 106,
    "pawmot": 107,
    "hoopa-unbound": 108,
    "araquanid": 109,
    "garchomp": 110,
    "steelix": 111,
    "weavile": 112,
    "tapu bulu": 113,
    "steelix-mega": 114,
    "raichu-alola": 115,
    "venusaur-mega": 116,
    "slowbro-galar": 117,
    "corsola-galar": 118,
    "pecharunt": 119,
    "iron moth": 120,
    "lopunny-mega": 121,
    "crustle": 122,
    "pinsir-mega": 123,
    "manaphy": 124,
    "dragonite": 125,
    "slowbro-mega": 126,
    "gardevoir": 127,
    "tyranitar-mega": 128,
    "kingdra": 129,
    "ludicolo": 130,
    "barraskewda": 131,
    "swampert-mega": 132,
    "manectric": 133,
    "manectric-mega": 134,
    "dracozolt": 135,
    "gyarados": 136,
    "okidogi": 137,
    "hydrapple": 138,
    "mudsdale": 139,
    "vileplume": 140,
    "farigiraf": 141,
    "zoroark-hisui": 142,
    "bronzong": 143,
    "muk-alola": 144,
    "altaria": 145,
    "altaria-mega": 146,
    "zeraora": 147,
    "hippowdon": 148,
    "diggersby": 149,
    "gardevoir-mega": 150,
    "gengar": 151,
    "meowscarada": 152,
    "sceptile": 153,
    "arctovish": 154,
    "cetitan": 155,
    "sceptile-mega": 156,
    "regieleki": 157,
    "tangrowth": 158,
    "charizard-mega-x": 159,
    "skarmory": 160,
    "murkrow": 161,
    "piloswine": 162,
    "stunfisk": 163,
    "tangela": 164,
    "lokix": 165,
    "sandy shocks": 166,
    "hawlucha": 167,
    "bisharp": 168,
    "carbink": 169,
    "mawile-mega": 170,
    "magnezone": 171,
    "torkoal": 172,
    "victini": 173,
    "exeggutor-alola": 174,
    "amoonguss": 175,
    "darmanitan": 176,
    "conkeldurr": 177,
    "gigalith": 178,
    "thundurus-therian": 179,
    "mew": 180,
    "alakazam": 181,
    "togekiss": 182,
    "rapidash-galar": 183,
    "glastrier": 184,
    "zebstrika": 185,
    "keldeo-resolute": 186,
    "cobalion": 187,
    "grimmsnarl": 188,
    "quaquaval": 189,
    "buzzwole": 190,
    "arctozolt": 191,
    "beedrill": 192,
    "porygon-z": 193,
    "audino": 194,
    "audino-mega": 195,
    "golem-alola": 196,
    "ribombee": 197,
    "enamorus": 198,
    "garchomp-mega": 199,
    "blastoise": 200,
    "gyarados-mega": 201,
    "rotom-wash": 202,
    "kleavor": 203,
    "volcanion": 204,
    "chansey": 205,
    "banette-mega": 206,
    "decidueye-hisui": 207,
    "salamence": 208,
    "chesnaught": 209,
    "skeledirge": 210,
    "tsareena": 211,
    "pikachu": 212,
    "keldeo": 213,
    "regidrago": 214,
    "archeops": 215,
    "ditto": 216,
    "mimikyu-busted": 217,
    "nidoking": 218,
    "aggron": 219,
    "aggron-mega": 220,
    "sealeo": 221,
    "xurkitree": 222,
    "archaludon": 223,
    "suicune": 224,
    "camerupt": 225,
    "shedinja": 226,
    "decidueye": 227,
    "haxorus": 228,
    "jynx": 229,
    "lucario": 230,
    "incineroar": 231,
    "polteageist-antique": 232,
    "camerupt-mega": 233,
    "dhelmise": 234,
    "donphan": 235,
    "terrakion": 236,
    "deoxys-defense": 237,
    "arcanine-hisui": 238,
    "milotic": 239,
    "electivire": 240,
    "maushold-four": 241,
    "reuniclus": 242,
    "dondozo": 243,
    "sableye": 244,
    "sableye-mega": 245,
    "ogerpon": 246,
    "leavanny": 247,
    "maushold": 248,
    "celesteela": 249,
    "jirachi": 250,
    "morpeko": 251,
    "latias-mega": 252,
    "whimsicott": 253,
    "ambipom": 254,
    "swellow": 255,
    "moltres-galar": 256,
    "polteageist": 257,
    "cloyster": 258,
    "walrein": 259,
    "sandslash": 260,
    "crobat": 261,
    "houndoom": 262,
    "houndoom-mega": 263,
    "iron boulder": 264,
    "brute bonnet": 265,
    "heracross": 266,
    "sandslash-alola": 267,
    "beedrill-mega": 268,
    "rhyperior": 269,
    "breloom": 270,
    "rotom-heat": 271,
    "ninetales": 272,
    "primarina": 273,
    "mabosstiff": 274,
    "iron thorns": 275,
    "dunsparce": 276,
    "necrozma": 277,
    "quagsire": 278,
    "clamperl": 279,
    "toxicroak": 280,
    "dubwool": 281,
    "pidgeot": 282,
    "arboliva": 283,
    "galvantula": 284,
    "pidgeot-mega": 285,
    "mismagius": 286,
    "oricorio-pom-pom": 287,
    "lurantis": 288,
    "aron": 289,
    "basculegion": 290,
    "sharpedo": 291,
    "gastrodon": 292,
    "tinkaton": 293,
    "goodra": 294,
    "sharpedo-mega": 295,
    "kabutops": 296,
    "armarouge": 297,
    "falinks": 298,
    "minior": 299
  }
}