{
  "token2id": {
    "<UNK>": 0,
    "toxic spikes": 1,
    "knock off": 2,
    "giga drain": 3,
    "earthquake": 4,
    "spikes": 5,
    "bulk up": 6,
    "body press": 7,
    "roost": 8,
    "thunderbolt": 9,
    "leech seed": 10,
    "quiver dance": 11,
    "hurricane": 12,
    "revelation dance": 13,
    "dual wingbeat": 14,
    "shell smash": 15,
    "power gem": 16,
    "fire blast": 17,
    "super fang": 18,
    "fake out": 19,
    "close combat": 20,
    "dragon energy": 21,
    "poison fang": 22,
    "thunder wave": 23,
    "steam eruption": 24,
    "brave bird": 25,
    "u-turn": 26,
    "hydro pump": 27,
    "trick room": 28,
    "revival blessing": 29,
    "rest": 30,
    "nasty plot": 31,
    "dark pulse": 32,
    "sludge bomb": 33,
    "double-edge": 34,
    "stealth rock": 35,
    "spore": 36,
    "poltergeist": 37,
    "toxic": 38,
    "drain punch": 39,
    "stone edge": 40,
    "iron head": 41,
    "swords dance": 42,
    "sucker punch": 43,
    "trick": 44,
    "throat chop": 45,
    "play rough": 46,
    "dragon dance": 47,
    "trailblaze": 48,
    "tail slap": 49,
    "focus blast": 50,
    "heavy slam": 51,
    "discharge": 52,
    "foul play": 53,
    "explosion": 54,
    "shadow ball": 55,
    "substitute": 56,
    "energy ball": 57,
    "dragon tail": 58,
    "secret sword": 59,
    "leaf blade": 60,
    "synthesis": 61,
    "draco meteor": 62,
    "iron defense": 63,
    "will-o-wisp": 64,
    "volt switch": 65,
    "blizzard": 66,
    "shift gear": 67,
    "tera blast": 68,
    "air slash": 69,
    "shadow sneak": 70,
    "head smash": 71,
    "calm mind": 72,
    "psyshock": 73,
    "water pulse": 74,
    "triple arrows": 75,
    "earth power": 76,
    "outrage": 77,
    "whirlpool": 78,
    "surf": 79,
    "zen headbutt": 80,
    "power whip": 81,
    "wish": 82,
    "tail glow": 83,
    "encore": 84,
    "alluring voice": 85,
    "ice beam": 86,
    "grassy glide": 87,
    "protect": 88,
    "facade": 89,
    "first impression": 90,
    "bullet seed": 91,
    "rock blast": 92,
    "apple acid": 93,
    "coil": 94,
    "recover": 95,
    "body slam": 96,
    "fickle beam": 97,
    "bug buzz": 98,
    "slack off": 99,
    "magnet rise": 100,
    "triple axel": 101,
    "sacred fire": 102,
    "scald": 103,
    "yawn": 104,
    "flip turn": 105,
    "sleep talk": 106,
    "take heart": 107,
    "flare blitz": 108,
    "aqua step": 109,
    "hyper voice": 110,
    "hypnosis": 111,
    "psychic noise": 112,
    "mach punch": 113,
    "gunk shot": 114,
    "moonblast": 115,
    "ice punch": 116,
    "moonlight": 117,
    "rapid spin": 118,
    "ice shard": 119,
    "shed tail": 120,
    "icicle crash": 121,
    "crunch": 122,
    "heat crash": 123,
    "bullet punch": 124,
    "precipice blades": 125,
    "wave crash": 126,
    "psychic": 127,
    "curse": 128,
    "icicle spear": 129,
    "waterfall": 130,
    "boomburst": 131,
    "rock polish": 132,
    "behemoth blade": 133,
    "make it rain": 134,
    "iron tail": 135,
    "reflect": 136,
    "light screen": 137,
    "parting shot": 138,
    "tri attack": 139,
    "gigaton hammer": 140,
    "aura wheel": 141,
    "tidy up": 142,
    "brick break": 143,
    "aurora veil": 144,
    "pyro ball": 145,
    "bleakwind storm": 146,
    "freeze-dry": 147,
    "heat wave": 148,
    "glare": 149,
    "kowtow cleave": 150,
    "work up": 151,
    "psystrike": 152,
    "scorching sands": 153,
    "teleport": 154,
    "sticky web": 155,
    "thunder": 156,
    "leaf storm": 157,
    "aqua cutter": 158,
    "fillet away": 159,
    "psycho cut": 160,
    "glaive rush": 161,
    "dazzling gleam": 162,
    "agility": 163,
    "beak blast": 164,
    "sleep powder": 165,
    "dynamax cannon": 166,
    "supercell slam": 167,
    "poison jab": 168,
    "roar": 169,
    "psychic fangs": 170,
    "lava plume": 171,
    "megahorn": 172,
    "judgment": 173,
    "draining kiss": 174,
    "endeavor": 175,
    "whirlwind": 176,
    "leech life": 177,
    "liquidation": 178,
    "soft-boiled": 179,
    "seismic toss": 180,
    "matcha gotcha": 181,
    "pain split": 182,
    "high jump kick": 183,
    "dynamic punch": 184,
    "mighty cleave": 185,
    "strength sap": 186,
    "superpower": 187,
    "high horsepower": 188,
    "overheat": 189,
    "sludge wave": 190,
    "population bomb": 191,
    "eruption": 192,
    "drill run": 193,
    "night slash": 194,
    "dragon pulse": 195,
    "ceaseless edge": 196,
    "grass knot": 197,
    "cosmic power": 198,
    "stone axe": 199,
    "muddy water": 200,
    "wild charge": 201,
    "haze": 202,
    "flame charge": 203,
    "spirit break": 204,
    "no retreat": 205,
    "mystical fire": 206,
    "flamethrower": 207,
    "psyblade": 208,
    "stored power": 209,
    "thunderclap": 210,
    "volt tackle": 211,
    "snowscape": 212,
    "nuzzle": 213,
    "flower trick": 214,
    "sunny day": 215,
    "weather ball": 216,
    "bolt strike": 217,
    "solar beam": 218,
    "salt cure": 219,
    "torch song": 220,
    "future sight": 221,
    "quick attack": 222,
    "flash cannon": 223,
    "taunt": 224,
    "diamond storm": 225,
    "sacred sword": 226,
    "rock slide": 227,
    "dire claw": 228,
    "headlong rush": 229,
    "morning sun": 230,
    "aqua jet": 231,
    "acrobatics": 232,
    "fiery dance": 233,
    "scale shot": 234,
    "bug bite": 235,
    "jet punch": 236,
    "electro drift": 237,
    "horn leech": 238,
    "psycho boost": 239,
    "wood hammer": 240,
    "luster purge": 241,
    "freezing glare": 242,
    "sunsteel strike": 243,
    "belly drum": 244,
    "ice spinner": 245,
    "overdrive": 246,
    "tera starstorm": 247,
    "rain dance": 248,
    "struggle": 249,
    "temper flare": 250,
    "night shade": 251,
    "extreme speed": 252,
    "avalanche": 253,
    "tachyon cutter": 254,
    "ivy cudgel": 255,
    "rock tomb": 256,
    "defog": 257,
    "chilly reception": 258,
    "zing zap": 259,
    "hyperspace fury": 260,
    "relic song": 261,
    "lunge": 262,
    "stomping tantrum": 263,
    "court change": 264,
    "shell side arm": 265,
    "crabhammer": 266,
    "stun spore": 267,
    "bitter malice": 268,
    "ice hammer": 269,
    "dragon claw": 270,
    "aeroblast": 271,
    "x-scissor": 272,
    "blood moon": 273,
    "magma storm": 274,
    "circle throw": 275,
    "blue flare": 276,
    "spacial rend": 277,
    "payback": 278,
    "headbutt": 279,
    "heal bell": 280,
    "seed flare": 281,
    "expanding force": 282,
    "giga impact": 283,
    "low kick": 284,
    "strange steam": 285,
    "focus punch": 286,
    "grav apple": 287,
    "bitter blade": 288,
    "sparkling aria": 289,
    "fiery wrath": 290,
    "malignant chain": 291,
    "astral barrage": 292,
    "origin pulse": 293,
    "seed bomb": 294,
    "clanging scales": 295,
    "fleur cannon": 296,
    "clangorous soul": 297,
    "pounce": 298,
    "dragon ascent": 299,
    "moongeist beam": 300,
    "meteor mash": 301,
    "shore up": 302,
    "hex": 303,
    "meteor beam": 304,
    "milk drink": 305,
    "clear smog": 306,
    "switcheroo": 307,
    "destiny bond": 308,
    "disable": 309,
    "aura sphere": 310,
    "vacuum wave": 311,
    "fire punch": 312,
    "ruination": 313,
    "armor cannon": 314,
    "raging bull": 315,
    "rage fist": 316,
    "shadow claw": 317,
    "esper wing": 318,
    "lash out": 319,
    "water spout": 320,
    "surging strikes": 321,
    "thunder punch": 322,
    "photon geyser": 323,
    "wicked blow": 324,
    "tailwind": 325,
    "double shock": 326,
    "fusion bolt": 327,
    "petal dance": 328,
    "victory dance": 329,
    "petal blizzard": 330,
    "bite": 331,
    "healing wish": 332,
    "dragon darts": 333,
    "mirror coat": 334,
    "lumina crash": 335,
    "accelerock": 336,
    "glacial lance": 337,
    "power trip": 338,
    "mud shot": 339,
    "razor shell": 340,
    "collision course": 341,
    "beat up": 342,
    "hydro steam": 343
  }
}