{
  "token2id": {
    "<UNK>": 0,
    "volcarona": 1,
    "krookodile": 2,
    "gengar": 3,
    "oricorio-pa'u": 4,
    "magcargo": 5,
    "qwilfish-hisui": 6,
    "electrode-hisui": 7,
    "corviknight": 8,
    "swampert": 9,
    "salamence": 10,
    "regidrago": 11,
    "iron treads": 12,
    "registeel": 13,
    "braviary": 14,
    "politoed": 15,
    "mightyena": 16,
    "mienshao": 17,
    "volcanion": 18,
    "rabsca": 19,
    "golduck": 20,
    "urshifu": 21,
    "furret": 22,
    "amoonguss": 23,
    "bombirdier": 24,
    "perrserker": 25,
    "darkrai": 26,
    "rhydon": 27,
    "trevenant": 28,
    "bisharp": 29,
    "persian": 30,
    "whiscash": 31,
    "cinccino": 32,
    "azumarill": 33,
    "overqwil": 34,
    "incineroar": 35,
    "copperajah": 36,
    "dragapult": 37,
    "keldeo-resolute": 38,
    "electrode": 39,
    "gallade": 40,
    "meloetta": 41,
    "pachirisu": 42,
    "meganium": 43,
    "dugtrio": 44,
    "cobalion": 45,
    "rotom-frost": 46,
    "muk": 47,
    "decidueye-hisui": 48,
    "sudowoodo": 49,
    "indeedee-f": 50,
    "farigiraf": 51,
    "dusknoir": 52,
    "kilowattrel": 53,
    "gholdengo": 54,
    "magearna-original": 55,
    "shaymin-sky": 56,
    "clawitzer": 57,
    "iron crown": 58,
    "talonflame": 59,
    "luvdisc": 60,
    "spiritomb": 61,
    "girafarig": 62,
    "gouging fire": 63,
    "venusaur": 64,
    "houndoom": 65,
    "medicham": 66,
    "ogerpon-cornerstone": 67,
    "rillaboom": 68,
    "dachsbun": 69,
    "lumineon": 70,
    "flareon": 71,
    "tauros-paldea-combat": 72,
    "appletun": 73,
    "wigglytuff": 74,
    "manaphy": 75,
    "leafeon": 76,
    "lokix": 77,
    "torterra": 78,
    "dunsparce": 79,
    "probopass": 80,
    "hydrapple": 81,
    "milotic": 82,
    "tatsugiri": 83,
    "vikavolt": 84,
    "vigoroth": 85,
    "brambleghast": 86,
    "ho-oh": 87,
    "klefki": 88,
    "dewgong": 89,
    "hariyama": 90,
    "sylveon": 91,
    "phione": 92,
    "scyther": 93,
    "quaquaval": 94,
    "magmortar": 95,
    "bronzong": 96,
    "conkeldurr": 97,
    "grafaiai": 98,
    "gardevoir": 99,
    "blaziken": 100,
    "tentacruel": 101,
    "zekrom": 102,
    "duraludon": 103,
    "victreebel": 104,
    "morpeko": 105,
    "clefable": 106,
    "electivire": 107,
    "vespiquen": 108,
    "regigigas": 109,
    "jolteon": 110,
    "weavile": 111,
    "brute bonnet": 112,
    "mamoswine": 113,
    "cyclizar": 114,
    "florges": 115,
    "scizor": 116,
    "groudon": 117,
    "hitmonchan": 118,
    "rotom-wash": 119,
    "toucannon": 120,
    "coalossal": 121,
    "lilligant-hisui": 122,
    "lapras": 123,
    "dondozo": 124,
    "zebstrika": 125,
    "mesprit": 126,
    "glalie": 127,
    "ceruledge": 128,
    "staraptor": 129,
    "thundurus-therian": 130,
    "quagsire": 131,
    "iron bundle": 132,
    "zapdos-galar": 133,
    "malamar": 134,
    "dudunsparce": 135,
    "forretress": 136,
    "palossand": 137,
    "tauros-paldea-aqua": 138,
    "eelektross": 139,
    "hydreigon": 140,
    "chien-pao": 141,
    "deoxys-attack": 142,
    "zacian-crowned": 143,
    "kyogre": 144,
    "carbink": 145,
    "toxtricity": 146,
    "archaludon": 147,
    "gothitelle": 148,
    "rhyperior": 149,
    "orthworm": 150,
    "grimmsnarl": 151,
    "porygon-z": 152,
    "pawmot": 153,
    "delibird": 154,
    "stonjourner": 155,
    "tinkaton": 156,
    "dodrio": 157,
    "abomasnow": 158,
    "serperior": 159,
    "gastrodon": 160,
    "tornadus-therian": 161,
    "cinderace": 162,
    "delphox": 163,
    "kingambit": 164,
    "wo-chien": 165,
    "pyroar": 166,
    "mewtwo": 167,
    "sandslash": 168,
    "chandelure": 169,
    "raikou": 170,
    "yanmega": 171,
    "tornadus": 172,
    "ninetales": 173,
    "gliscor": 174,
    "deoxys-defense": 175,
    "zangoose": 176,
    "scream tail": 177,
    "baxcalibur": 178,
    "ursaring": 179,
    "gumshoos": 180,
    "galvantula": 181,
    "sunflora": 182,
    "veluza": 183,
    "greedent": 184,
    "ariados": 185,
    "excadrill": 186,
    "vivillon-polar": 187,
    "sableye": 188,
    "houndstone": 189,
    "eternatus": 190,
    "luxray": 191,
    "enamorus-therian": 192,
    "terrakion": 193,
    "heatran": 194,
    "arceus-ghost": 195,
    "giratina-origin": 196,
    "oricorio": 197,
    "bruxish": 198,
    "comfey": 199,
    "umbreon": 200,
    "jirachi": 201,
    "falinks": 202,
    "mew": 203,
    "hippowdon": 204,
    "munkidori": 205,
    "roaring moon": 206,
    "flygon": 207,
    "regice": 208,
    "arbok": 209,
    "wyrdeer": 210,
    "thundurus": 211,
    "breloom": 212,
    "sandy shocks": 213,
    "slaking": 214,
    "lunala": 215,
    "blissey": 216,
    "illumise": 217,
    "regirock": 218,
    "drednaw": 219,
    "swalot": 220,
    "sneasler": 221,
    "espeon": 222,
    "sinistcha-masterpiece": 223,
    "azelf": 224,
    "regieleki": 225,
    "flutter mane": 226,
    "zamazenta": 227,
    "oinkologne-f": 228,
    "barraskewda": 229,
    "bastiodon": 230,
    "golurk": 231,
    "iron leaves": 232,
    "iron boulder": 233,
    "polteageist-antique": 234,
    "zoroark-hisui": 235,
    "spidops": 236,
    "tropius": 237,
    "mudsdale": 238,
    "drifblim": 239,
    "giratina": 240,
    "ribombee": 241,
    "vileplume": 242,
    "raichu-alola": 243,
    "rampardos": 244,
    "dragalge": 245,
    "rotom-fan": 246,
    "kommo-o": 247,
    "oricorio-sensu": 248,
    "leavanny": 249,
    "toxapex": 250,
    "smeargle": 251,
    "lucario": 252,
    "typhlosion": 253,
    "cloyster": 254,
    "metagross": 255,
    "ditto": 256,
    "dipplin": 257,
    "komala": 258,
    "misdreavus": 259,
    "noivern": 260,
    "minun": 261,
    "tyranitar": 262,
    "kleavor": 263,
    "alomomola": 264,
    "cryogonal": 265,
    "chimecho": 266,
    "garchomp": 267,
    "crawdaunt": 268,
    "iron hands": 269,
    "bellibolt": 270,
    "slither wing": 271,
    "charizard": 272,
    "enamorus": 273,
    "scovillain": 274,
    "venomoth": 275,
    "infernape": 276,
    "maushold": 277,
    "mabosstiff": 278,
    "raging bolt": 279,
    "solgaleo": 280,
    "pikachu": 281,
    "zarude": 282,
    "beartic": 283,
    "samurott-hisui": 284,
    "greninja": 285,
    "hatterene": 286,
    "lilligant": 287,
    "glimmora": 288,
    "cacturne": 289,
    "dragonite": 290,
    "meowscarada": 291,
    "meowstic-f": 292,
    "noctowl": 293,
    "skarmory": 294,
    "kricketune": 295,
    "skuntank": 296,
    "landorus": 297,
    "zamazenta-crowned": 298,
    "arboliva": 299,
    "dugtrio-alola": 300,
    "kingdra": 301,
    "espathra": 302,
    "gyarados": 303,
    "avalugg-hisui": 304,
    "latios": 305,
    "florges-orange": 306,
    "garganacl": 307,
    "skeledirge": 308,
    "swanna": 309,
    "iron thorns": 310,
    "jumpluff": 311,
    "ogerpon-wellspring": 312,
    "goodra": 313,
    "toxicroak": 314,
    "frosmoth": 315,
    "lanturn": 316,
    "heracross": 317,
    "great tusk": 318,
    "inteleon": 319,
    "slowking": 320,
    "ampharos": 321,
    "hawlucha": 322,
    "passimian": 323,
    "araquanid": 324,
    "virizion": 325,
    "diancie": 326,
    "grumpig": 327,
    "flamigo": 328,
    "arceus-water": 329,
    "snorlax": 330,
    "sceptile": 331,
    "ursaluna": 332,
    "latias": 333,
    "samurott": 334,
    "miraidon": 335,
    "chi-yu": 336,
    "primarina": 337,
    "arceus-fire": 338,
    "palafin": 339,
    "palafin-hero": 340,
    "slowbro": 341,
    "okidogi": 342,
    "zapdos": 343,
    "hypno": 344,
    "alcremie-ruby-swirl": 345,
    "rotom": 346,
    "blastoise": 347,
    "chesnaught": 348,
    "persian-alola": 349,
    "florges-blue": 350,
    "lycanroc": 351,
    "dedenne": 352,
    "arceus-steel": 353,
    "lugia": 354,
    "honchkrow": 355,
    "salazzle": 356,
    "hitmontop": 357,
    "palkia-origin": 358,
    "donphan": 359,
    "ambipom": 360,
    "wugtrio": 361,
    "scrafty": 362,
    "qwilfish": 363,
    "articuno-galar": 364,
    "gurdurr": 365,
    "sandslash-alola": 366,
    "hoopa": 367,
    "alcremie-rainbow-swirl": 368,
    "mimikyu": 369,
    "eiscue": 370,
    "iron moth": 371,
    "cetitan": 372,
    "fezandipiti": 373,
    "haxorus": 374,
    "terapagos": 375,
    "cresselia": 376,
    "reuniclus": 377,
    "clodsire": 378,
    "magnezone": 379,
    "minior-yellow": 380,
    "volbeat": 381,
    "decidueye": 382,
    "deoxys": 383,
    "articuno": 384,
    "feraligatr": 385,
    "revavroom": 386,
    "altaria": 387,
    "pelipper": 388,
    "arcanine": 389,
    "iron jugulis": 390,
    "torkoal": 391,
    "masquerain": 392,
    "ting-lu": 393,
    "bellossom": 394,
    "ludicolo": 395,
    "exeggutor": 396,
    "muk-alola": 397,
    "basculin": 398,
    "ogerpon": 399,
    "koraidon": 400,
    "chansey": 401,
    "plusle": 402,
    "hoopa-unbound": 403,
    "suicune": 404,
    "pincurchin": 405,
    "weezing": 406,
    "klawf": 407,
    "banette": 408,
    "urshifu-rapid-strike": 409,
    "reshiram": 410,
    "raichu": 411,
    "exeggutor-alola": 412,
    "slowbro-galar": 413,
    "squawkabilly-blue": 414,
    "meowstic": 415,
    "whimsicott": 416,
    "mismagius": 417,
    "tsareena": 418,
    "mandibuzz": 419,
    "toedscruel": 420,
    "tauros-paldea-blaze": 421,
    "florges-white": 422,
    "granbull": 423,
    "shiftry": 424,
    "crabominable": 425,
    "seviper": 426,
    "sinistcha": 427,
    "vaporeon": 428,
    "glaceon": 429,
    "dudunsparce-three-segment": 430,
    "camerupt": 431,
    "arceus-psychic": 432,
    "froslass": 433,
    "poliwrath": 434,
    "ursaluna-bloodmoon": 435,
    "oricorio-pom-pom": 436,
    "vivillon-river": 437,
    "necrozma-dusk-mane": 438,
    "rotom-mow": 439,
    "iron valiant": 440,
    "tauros": 441,
    "palkia": 442,
    "lurantis": 443,
    "porygon2": 444,
    "indeedee": 445,
    "shaymin": 446,
    "landorus-therian": 447,
    "armarouge": 448,
    "goodra-hisui": 449,
    "minior-violet": 450,
    "weezing-galar": 451,
    "calyrex": 452,
    "cramorant": 453,
    "flapple": 454,
    "floatzel": 455,
    "entei": 456,
    "piloswine": 457,
    "emboar": 458,
    "annihilape": 459,
    "moltres-galar": 460,
    "alcremie-mint-cream": 461,
    "oranguru": 462,
    "pecharunt": 463,
    "calyrex-shadow": 464,
    "glastrier": 465,
    "spectrier": 466,
    "sandaconda": 467,
    "rayquaza": 468,
    "empoleon": 469,
    "lycanroc-midnight": 470,
    "basculin-blue-striped": 471,
    "alcremie-ruby-cream": 472,
    "arceus-poison": 473,
    "vivillon-high plains": 474,
    "gogoat": 475,
    "sawsbuck-winter": 476,
    "hitmonlee": 477,
    "arceus-electric": 478,
    "zarude-dada": 479,
    "sawsbuck-summer": 480,
    "lycanroc-dusk": 481,
    "moltres": 482,
    "walking wake": 483,
    "minior": 484,
    "uxie": 485,
    "calyrex-ice": 486,
    "maushold-four": 487,
    "golem-alola": 488,
    "alcremie-caramel-swirl": 489,
    "dialga": 490,
    "alcremie-salted-cream": 491,
    "polteageist": 492,
    "basculegion-f": 493,
    "ogerpon-hearthflame": 494,
    "typhlosion-hisui": 495,
    "mimikyu-busted": 496,
    "pikachu-original": 497,
    "braviary-hisui": 498,
    "deoxys-speed": 499,
    "dialga-origin": 500,
    "terapagos-terastal": 501,
    "oinkologne": 502,
    "kyurem-white": 503,
    "florges-yellow": 504,
    "sawsbuck": 505,
    "necrozma-dawn-wings": 506,
    "golem": 507,
    "zacian": 508,
    "squawkabilly-yellow": 509,
    "arceus-bug": 510,
    "kyurem-black": 511,
    "arceus-ground": 512,
    "ninetales-alola": 513,
    "avalugg": 514,
    "necrozma": 515,
    "vivillon-modern": 516,
    "slowking-galar": 517,
    "kyurem": 518,
    "pikachu-sinnoh": 519,
    "alcremie-lemon-cream": 520,
    "arcanine-hisui": 521,
    "gastrodon-east": 522,
    "squawkabilly": 523,
    "vivillon-savanna": 524,
    "minior-orange": 525,
    "vivillon-jungle": 526,
    "arceus-dragon": 527,
    "magearna": 528,
    "arceus-fairy": 529,
    "sawsbuck-autumn": 530,
    "ogerpon-wellspring-tera": 531,
    "arceus-flying": 532,
    "arceus-fighting": 533,
    "vivillon-sun": 534,
    "pikachu-alola": 535,
    "arceus": 536,
    "arceus-rock": 537,
    "rotom-heat": 538,
    "basculegion": 539,
    "squawkabilly-white": 540,
    "pikachu-hoenn": 541,
    "vivillon-marine": 542,
    "arceus-grass": 543,
    "minior-green": 544,
    "vivillon-monsoon": 545
  }
}