{
  "token2id": {
    "<UNK>": 0,
    "garchomp": 1,
    "goodra-hisui": 2,
    "iron moth": 3,
    "sinistcha": 4,
    "slowking": 5,
    "zapdos-galar": 6,
    "enamorus": 7,
    "gholdengo": 8,
    "great tusk": 9,
    "ogerpon-wellspring": 10,
    "raging bolt": 11,
    "ribombee": 12,
    "heatran": 13,
    "rillaboom": 14,
    "serperior": 15,
    "zamazenta": 16,
    "zamazenta-*": 17,
    "arcanine-hisui": 18,
    "darkrai": 19,
    "tyranitar": 20,
    "zapdos": 21,
    "ninetales-alola": 22,
    "weezing-galar": 23,
    "klefki": 24,
    "kyurem": 25,
    "latias": 26,
    "maushold-four": 27,
    "okidogi": 28,
    "ceruledge": 29,
    "hatterene": 30,
    "scovillain": 31,
    "torkoal": 32,
    "walking wake": 33,
    "iron treads": 34,
    "iron valiant": 35,
    "deoxys-speed": 36,
    "dragonite": 37,
    "glimmora": 38,
    "kingambit": 39,
    "blastoise": 40,
    "haxorus": 41,
    "volcanion": 42,
    "frosmoth": 43,
    "iron hands": 44,
    "pawmot": 45,
    "pincurchin": 46,
    "raichu-alola": 47,
    "rotom-wash": 48,
    "clefable": 49,
    "clodsire": 50,
    "corviknight": 51,
    "dondozo": 52,
    "gliscor": 53,
    "toxapex": 54,
    "dragapult": 55,
    "alomomola": 56,
    "cinderace": 57,
    "ditto": 58,
    "ting-lu": 59,
    "landorus-therian": 60,
    "blissey": 61,
    "talonflame": 62,
    "araquanid": 63,
    "chesnaught": 64,
    "excadrill": 65,
    "tornadus-therian": 66,
    "hoopa-unbound": 67,
    "pecharunt": 68,
    "primarina": 69,
    "hitmonlee": 70,
    "indeedee": 71,
    "iron crown": 72,
    "polteageist-antique": 73,
    "hydreigon": 74,
    "ogerpon": 75,
    "tinkaton": 76,
    "samurott-hisui": 77,
    "floatzel": 78,
    "pelipper": 79,
    "toxicroak": 80,
    "mamoswine": 81,
    "slowking-galar": 82,
    "cetitan": 83,
    "meowscarada": 84,
    "crawdaunt": 85,
    "tsareena": 86,
    "vikavolt": 87,
    "scizor": 88,
    "skarmory": 89,
    "barraskewda": 90,
    "kingdra": 91,
    "manaphy": 92,
    "raikou": 93,
    "empoleon": 94,
    "bronzong": 95,
    "lilligant-hisui": 96,
    "minior-blue": 97,
    "venusaur": 98,
    "staraptor": 99,
    "galvantula": 100,
    "salamence": 101,
    "ninetales": 102,
    "brambleghast": 103,
    "kleavor": 104,
    "moltres": 105,
    "iron jugulis": 106,
    "latios": 107,
    "sandy shocks": 108,
    "greninja": 109,
    "greninja-*": 110,
    "abomasnow": 111,
    "armarouge": 112,
    "hawlucha": 113,
    "scream tail": 114,
    "cloyster": 115,
    "sandslash-alola": 116,
    "weavile": 117,
    "wo-chien": 118,
    "ogerpon-teal-tera": 119,
    "lokix": 120,
    "porygon-z": 121,
    "golduck": 122,
    "tentacruel": 123,
    "keldeo-resolute": 124,
    "zarude": 125,
    "amoonguss": 126,
    "overqwil": 127,
    "articuno-galar": 128,
    "blaziken": 129,
    "zoroark-hisui": 130,
    "polteageist": 131,
    "metagross": 132,
    "espeon": 133,
    "gardevoir": 134,
    "lucario": 135,
    "cinccino": 136,
    "garganacl": 137,
    "magnezone": 138,
    "conkeldurr": 139,
    "ursaluna": 140,
    "keldeo": 141,
    "cresselia": 142,
    "hydrapple": 143,
    "jirachi": 144,
    "ogerpon-wellspring-tera": 145,
    "kommo-o": 146,
    "grimmsnarl": 147,
    "glaceon": 148,
    "cobalion": 149,
    "moltres-galar": 150,
    "ogerpon-cornerstone": 151,
    "thundurus-therian": 152,
    "fezandipiti": 153,
    "charizard": 154,
    "zoroark": 155,
    "muk-alola": 156,
    "regidrago": 157,
    "mudsdale": 158,
    "rhyperior": 159,
    "mandibuzz": 160,
    "yanmega": 161,
    "typhlosion-hisui": 162,
    "jolteon": 163,
    "sylveon": 164,
    "umbreon": 165,
    "vaporeon": 166,
    "salazzle": 167,
    "milotic": 168,
    "skeledirge": 169,
    "probopass": 170,
    "toucannon": 171,
    "quaquaval": 172,
    "incineroar": 173,
    "rotom-heat": 174,
    "azumarill": 175,
    "swampert": 176,
    "slowbro": 177,
    "iron boulder": 178,
    "comfey": 179,
    "whimsicott": 180,
    "bellibolt": 181,
    "porygon2": 182,
    "sinistcha-masterpiece": 183,
    "eelektross": 184,
    "lycanroc-midnight": 185,
    "maushold": 186,
    "mesprit": 187,
    "slither wing": 188,
    "swalot": 189,
    "gallade": 190,
    "breloom": 191,
    "meloetta": 192,
    "farigiraf": 193,
    "reuniclus": 194,
    "exeggutor": 195,
    "slowbro-galar": 196,
    "diancie": 197,
    "lilligant": 198,
    "brute bonnet": 199,
    "deoxys-defense": 200,
    "entei": 201,
    "kilowattrel": 202,
    "ludicolo": 203,
    "politoed": 204,
    "noivern": 205,
    "leavanny": 206,
    "hippowdon": 207,
    "mimikyu": 208,
    "houndoom": 209,
    "cyclizar": 210,
    "terrakion": 211,
    "thundurus": 212,
    "dudunsparce": 213,
    "dudunsparce-*": 214,
    "arboliva": 215,
    "mimikyu-busted": 216,
    "glastrier": 217,
    "gengar": 218,
    "infernape": 219,
    "sceptile": 220,
    "gastrodon-east": 221,
    "barboach": 222,
    "cetoddle": 223,
    "cleffa": 224,
    "eiscue": 225,
    "regice": 226,
    "rhydon": 227,
    "beartic": 228,
    "poliwrath": 229,
    "shiftry": 230,
    "snorlax": 231,
    "typhlosion": 232,
    "inteleon": 233,
    "regieleki": 234,
    "grafaiai": 235,
    "revavroom": 236,
    "squirtle": 237,
    "basculegion": 238,
    "clawitzer": 239,
    "delphox": 240,
    "oricorio-sensu": 241,
    "dodrio": 242,
    "shaymin": 243,
    "altaria": 244,
    "cacturne": 245,
    "granbull": 246,
    "dugtrio": 247,
    "vileplume": 248,
    "lycanroc-dusk": 249,
    "pikachu": 250,
    "spiritomb": 251,
    "honchkrow": 252,
    "regigigas": 253,
    "slaking": 254,
    "hitmontop": 255,
    "feraligatr": 256,
    "meganium": 257,
    "gyarados": 258,
    "medicham": 259,
    "pyroar": 260,
    "dusknoir": 261,
    "braviary-hisui": 262,
    "decidueye-hisui": 263,
    "masquerain": 264,
    "malamar": 265,
    "chandelure": 266,
    "gastrodon": 267,
    "chansey": 268,
    "munkidori": 269,
    "weezing": 270,
    "dusclops": 271,
    "wugtrio": 272,
    "exeggutor-alola": 273,
    "hoopa": 274,
    "bruxish": 275,
    "zangoose": 276,
    "goodra": 277,
    "crocalor": 278,
    "sableye": 279,
    "appletun": 280,
    "donphan": 281,
    "eiscue-noice": 282,
    "minior-indigo": 283,
    "froslass": 284,
    "carbink": 285,
    "quagsire": 286,
    "arbok": 287,
    "ariados": 288,
    "basculin": 289,
    "dedenne": 290,
    "uxie": 291,
    "suicune": 292,
    "drifblim": 293,
    "hitmonchan": 294,
    "orthworm": 295,
    "dragalge": 296,
    "lapras": 297,
    "necrozma": 298,
    "rabsca": 299,
    "duraludon": 300,
    "greedent": 301,
    "avalugg": 302,
    "electrode-hisui": 303,
    "bisharp": 304,
    "gumshoos": 305,
    "scyther": 306,
    "electivire": 307,
    "trevenant": 308,
    "metang": 309,
    "mienshao": 310,
    "mabosstiff": 311,
    "oinkologne-f": 312,
    "drednaw": 313,
    "minior-green": 314,
    "torterra": 315,
    "bellossom": 316,
    "minior": 317,
    "arcanine": 318,
    "lurantis": 319,
    "seviper": 320,
    "squawkabilly-yellow": 321,
    "mightyena": 322,
    "ambipom": 323,
    "dunsparce": 324,
    "toxtricity": 325,
    "golurk": 326,
    "minior-violet": 327,
    "illumise": 328,
    "trapinch": 329,
    "krookodile": 330,
    "iron thorns": 331,
    "luxray": 332,
    "meowstic": 333,
    "noctowl": 334,
    "tornadus": 335,
    "articuno": 336,
    "cryogonal": 337,
    "flygon": 338,
    "mew": 339,
    "enamorus-therian": 340,
    "indeedee-f": 341,
    "regirock": 342,
    "sandaconda": 343,
    "forretress": 344,
    "poliwhirl": 345,
    "rampardos": 346,
    "pikachu-sinnoh": 347,
    "emboar": 348,
    "heracross": 349,
    "raichu": 350,
    "mismagius": 351,
    "furret": 352,
    "dachsbun": 353,
    "tauros-paldea-blaze": 354,
    "azelf": 355,
    "dewgong": 356,
    "flareon": 357,
    "golem-alola": 358,
    "cramorant": 359,
    "coalossal": 360,
    "klawf": 361,
    "smeargle": 362,
    "oricorio": 363,
    "scrafty": 364,
    "archaludon": 365,
    "tatsugiri": 366,
    "electabuzz": 367,
    "volcarona": 368,
    "annihilape": 369,
    "oranguru": 370,
    "ursaluna-bloodmoon": 371,
    "clefairy": 372,
    "alcremie": 373,
    "sneasler": 374,
    "flamigo": 375,
    "magmar": 376,
    "murkrow": 377,
    "arceus-ground": 378,
    "deoxys-attack": 379,
    "koraidon": 380,
    "kyurem-black": 381,
    "necrozma-dusk-mane": 382,
    "rayquaza": 383,
    "arceus": 384,
    "ho-oh": 385,
    "kyogre": 386,
    "zacian-*": 387,
    "zacian-crowned": 388,
    "mewtwo": 389,
    "landorus": 390,
    "ogerpon-hearthflame": 391,
    "chi-yu": 392,
    "roaring moon": 393,
    "chien-pao": 394,
    "palafin": 395,
    "palafin-hero": 396,
    "jumpluff": 397,
    "gouging fire": 398,
    "spectrier": 399,
    "riolu": 400,
    "ogerpon-hearthflame-tera": 401,
    "baxcalibur": 402,
    "stantler": 403,
    "registeel": 404,
    "rotom-frost": 405,
    "golem": 406,
    "houndstone": 407,
    "dudunsparce-three-segment": 408,
    "oricorio-pom-pom": 409,
    "poltchageist": 410,
    "basculegion-f": 411,
    "toedscruel": 412,
    "iron bundle": 413,
    "alcremie-matcha-cream": 414,
    "rotom-fan": 415,
    "yanma": 416,
    "sunflora": 417,
    "avalugg-hisui": 418,
    "sudowoodo": 419,
    "perrserker": 420,
    "deoxys": 421,
    "sneasel-hisui": 422,
    "shaymin-sky": 423
  }
}