{
  "token2id": {
    "<UNK>": 0,
    "ninetales-alola": 1,
    "incineroar": 2,
    "landorus": 3,
    "kingambit": 4,
    "kyurem": 5,
    "rillaboom": 6,
    "gholdengo": 7,
    "glimmora": 8,
    "ogerpon-hearthflame": 9,
    "tornadus": 10,
    "torkoal": 11,
    "grimmsnarl": 12,
    "raging bolt": 13,
    "chi-yu": 14,
    "hatterene": 15,
    "brute bonnet": 16,
    "hoopa-unbound": 17,
    "ursaluna": 18,
    "indeedee-f": 19,
    "volcanion": 20,
    "moltres-galar": 21,
    "sinistcha": 22,
    "roaring moon": 23,
    "dragonite": 24,
    "scizor": 25,
    "arcanine": 26,
    "palafin": 27,
    "chien-pao": 28,
    "palafin-hero": 29,
    "ogerpon-wellspring": 30,
    "okidogi": 31,
    "kommo-o": 32,
    "amoonguss": 33,
    "porygon2": 34,
    "walking wake": 35,
    "jumpluff": 36,
    "lilligant-hisui": 37,
    "diancie": 38,
    "iron crown": 39,
    "regidrago": 40,
    "clefable": 41,
    "sneasler": 42,
    "volcarona": 43,
    "ting-lu": 44,
    "gouging fire": 45,
    "arcanine-hisui": 46,
    "farigiraf": 47,
    "typhlosion-hisui": 48,
    "pelipper": 49,
    "primarina": 50,
    "sinistcha-masterpiece": 51,
    "rhyperior": 52,
    "iron hands": 53,
    "armarouge": 54,
    "tyranitar": 55,
    "garganacl": 56,
    "iron boulder": 57,
    "kleavor": 58,
    "ogerpon-cornerstone": 59,
    "oranguru": 60,
    "ursaluna-bloodmoon": 61,
    "spectrier": 62,
    "landorus-therian": 63,
    "whimsicott": 64,
    "excadrill": 65,
    "orthworm": 66,
    "latios": 67,
    "flamigo": 68,
    "klefki": 69,
    "hitmontop": 70,
    "murkrow": 71,
    "chandelure": 72,
    "zapdos-galar": 73,
    "tsareena": 74,
    "metagross": 75,
    "sylveon": 76,
    "blaziken": 77,
    "lucario": 78,
    "riolu": 79,
    "jirachi": 80,
    "milotic": 81,
    "bronzong": 82,
    "zoroark-hisui": 83,
    "pecharunt": 84,
    "cresselia": 85,
    "ogerpon-hearthflame-tera": 86,
    "garchomp": 87,
    "mew": 88,
    "heatran": 89,
    "sandy shocks": 90,
    "gengar": 91,
    "araquanid": 92,
    "baxcalibur": 93,
    "articuno-galar": 94,
    "stantler": 95,
    "clefairy": 96,
    "registeel": 97,
    "regice": 98,
    "iron valiant": 99,
    "ninetales": 100,
    "breloom": 101,
    "enamorus-therian": 102,
    "thundurus": 103,
    "enamorus": 104,
    "comfey": 105,
    "vikavolt": 106,
    "lycanroc-dusk": 107,
    "ribombee": 108,
    "kilowattrel": 109,
    "rotom-frost": 110,
    "torterra": 111,
    "toxapex": 112,
    "goodra-hisui": 113,
    "terrakion": 114,
    "smeargle": 115,
    "corviknight": 116,
    "dragapult": 117,
    "weezing-galar": 118,
    "golem": 119,
    "houndstone": 120,
    "gallade": 121,
    "hydrapple": 122,
    "skeledirge": 123,
    "scrafty": 124,
    "malamar": 125,
    "hitmonchan": 126,
    "krookodile": 127,
    "talonflame": 128,
    "dudunsparce-*": 129,
    "maushold-four": 130,
    "toxtricity": 131,
    "dudunsparce-three-segment": 132,
    "barraskewda": 133,
    "oricorio-pom-pom": 134,
    "poltchageist": 135,
    "tinkaton": 136,
    "basculegion-f": 137,
    "samurott-hisui": 138,
    "pincurchin": 139,
    "weezing": 140,
    "iron jugulis": 141,
    "iron moth": 142,
    "dondozo": 143,
    "exeggutor-alola": 144,
    "indeedee": 145,
    "lilligant": 146,
    "lapras": 147,
    "charizard": 148,
    "rhydon": 149,
    "venusaur": 150,
    "blastoise": 151,
    "cinderace": 152,
    "serperior": 153,
    "gastrodon": 154,
    "kingdra": 155,
    "thundurus-therian": 156,
    "shiftry": 157,
    "zapdos": 158,
    "salamence": 159,
    "ogerpon-wellspring-tera": 160,
    "weavile": 161,
    "mienshao": 162,
    "toedscruel": 163,
    "empoleon": 164,
    "azumarill": 165,
    "iron bundle": 166,
    "alcremie-matcha-cream": 167,
    "coalossal": 168,
    "slowbro": 169,
    "keldeo": 170,
    "politoed": 171,
    "gyarados": 172,
    "raikou": 173,
    "dusclops": 174,
    "conkeldurr": 175,
    "exeggutor": 176,
    "rotom-fan": 177,
    "yanma": 178,
    "scream tail": 179,
    "sunflora": 180,
    "great tusk": 181,
    "infernape": 182,
    "meowscarada": 183,
    "articuno": 184,
    "avalugg-hisui": 185,
    "suicune": 186,
    "hydreigon": 187,
    "gastrodon-east": 188,
    "tauros-paldea-blaze": 189,
    "entei": 190,
    "sableye": 191,
    "lycanroc-midnight": 192,
    "sudowoodo": 193,
    "bruxish": 194,
    "regigigas": 195,
    "oricorio-sensu": 196,
    "espeon": 197,
    "ceruledge": 198,
    "cetitan": 199,
    "glastrier": 200,
    "gardevoir": 201,
    "slither wing": 202,
    "magnezone": 203,
    "mamoswine": 204,
    "frosmoth": 205,
    "snorlax": 206,
    "perrserker": 207,
    "slaking": 208,
    "deoxys": 209,
    "latias": 210,
    "decidueye-hisui": 211,
    "sneasel-hisui": 212,
    "braviary-hisui": 213,
    "wo-chien": 214,
    "deoxys-defense": 215,
    "umbreon": 216,
    "rotom-wash": 217,
    "abomasnow": 218,
    "regieleki": 219,
    "masquerain": 220,
    "electivire": 221,
    "greninja-*": 222,
    "greninja": 223,
    "shaymin-sky": 224,
    "ogerpon": 225,
    "rampardos": 226,
    "zamazenta-*": 227,
    "clodsire": 228,
    "zamazenta": 229,
    "kartana": 230,
    "tornadus-therian": 231,
    "swampert": 232,
    "mimikyu": 233,
    "ferrothorn": 234,
    "cyclizar": 235,
    "blacephalon": 236,
    "latios-mega": 237,
    "alomomola": 238,
    "mandibuzz": 239,
    "slowking-galar": 240,
    "scizor-mega": 241,
    "medicham": 242,
    "medicham-mega": 243,
    "diancie-mega": 244,
    "tapu lele": 245,
    "iron treads": 246,
    "mawile": 247,
    "marowak-alola": 248,
    "aegislash": 249,
    "gliscor": 250,
    "aerodactyl": 251,
    "heliolisk": 252,
    "iron leaves": 253,
    "tapu koko": 254,
    "slowking": 255,
    "moltres": 256,
    "pinsir": 257,
    "melmetal": 258,
    "terapagos": 259,
    "absol": 260,
    "staraptor": 261,
    "tapu fini": 262,
    "absol-mega": 263,
    "aerodactyl-mega": 264,
    "urshifu-*": 265,
    "banette": 266,
    "charizard-mega-y": 267,
    "lopunny": 268,
    "gallade-mega": 269,
    "blissey": 270,
    "terapagos-terastal": 271,
    "urshifu-rapid-strike": 272,
    "pawmot": 273,
    "steelix": 274,
    "tapu bulu": 275,
    "steelix-mega": 276,
    "raichu-alola": 277,
    "venusaur-mega": 278,
    "slowbro-galar": 279,
    "corsola-galar": 280,
    "lopunny-mega": 281,
    "crustle": 282,
    "pinsir-mega": 283,
    "manaphy": 284,
    "slowbro-mega": 285,
    "tyranitar-mega": 286,
    "ludicolo": 287,
    "swampert-mega": 288,
    "manectric": 289,
    "manectric-mega": 290,
    "dracozolt": 291,
    "mudsdale": 292,
    "vileplume": 293,
    "muk-alola": 294,
    "altaria": 295,
    "altaria-mega": 296,
    "zeraora": 297,
    "hippowdon": 298,
    "diggersby": 299,
    "gardevoir-mega": 300,
    "sceptile": 301,
    "arctovish": 302,
    "sceptile-mega": 303,
    "tangrowth": 304,
    "charizard-mega-x": 305,
    "skarmory": 306,
    "piloswine": 307,
    "stunfisk": 308,
    "tangela": 309,
    "lokix": 310,
    "hawlucha": 311,
    "bisharp": 312,
    "carbink": 313,
    "mawile-mega": 314,
    "victini": 315,
    "darmanitan": 316,
    "gigalith": 317,
    "alakazam": 318,
    "togekiss": 319,
    "rapidash-galar": 320,
    "zebstrika": 321,
    "keldeo-resolute": 322,
    "cobalion": 323,
    "quaquaval": 324,
    "buzzwole": 325,
    "arctozolt": 326,
    "beedrill": 327,
    "porygon-z": 328,
    "audino": 329,
    "audino-mega": 330,
    "golem-alola": 331,
    "garchomp-mega": 332,
    "gyarados-mega": 333,
    "chansey": 334,
    "banette-mega": 335,
    "chesnaught": 336,
    "pikachu": 337,
    "archeops": 338,
    "ditto": 339,
    "mimikyu-busted": 340,
    "nidoking": 341,
    "aggron": 342,
    "aggron-mega": 343,
    "sealeo": 344,
    "xurkitree": 345,
    "archaludon": 346,
    "camerupt": 347,
    "shedinja": 348,
    "decidueye": 349,
    "haxorus": 350,
    "jynx": 351,
    "polteageist-antique": 352,
    "camerupt-mega": 353,
    "dhelmise": 354,
    "donphan": 355,
    "reuniclus": 356,
    "sableye-mega": 357,
    "leavanny": 358,
    "maushold": 359,
    "celesteela": 360,
    "morpeko": 361,
    "latias-mega": 362,
    "ambipom": 363,
    "swellow": 364,
    "polteageist": 365,
    "cloyster": 366,
    "walrein": 367,
    "sandslash": 368,
    "crobat": 369,
    "houndoom": 370,
    "houndoom-mega": 371,
    "heracross": 372,
    "sandslash-alola": 373,
    "beedrill-mega": 374,
    "rotom-heat": 375,
    "mabosstiff": 376,
    "iron thorns": 377,
    "dunsparce": 378,
    "necrozma": 379,
    "quagsire": 380,
    "clamperl": 381,
    "toxicroak": 382,
    "dubwool": 383,
    "pidgeot": 384,
    "arboliva": 385,
    "galvantula": 386,
    "pidgeot-mega": 387,
    "mismagius": 388,
    "lurantis": 389,
    "aron": 390,
    "basculegion": 391,
    "sharpedo": 392,
    "goodra": 393,
    "sharpedo-mega": 394,
    "kabutops": 395,
    "falinks": 396,
    "minior": 397,
    "darkrai": 398,
    "scovillain": 399,
    "deoxys-speed": 400,
    "hitmonlee": 401,
    "floatzel": 402,
    "crawdaunt": 403,
    "minior-blue": 404,
    "brambleghast": 405,
    "ogerpon-teal-tera": 406,
    "golduck": 407,
    "tentacruel": 408,
    "zarude": 409,
    "overqwil": 410,
    "cinccino": 411,
    "glaceon": 412,
    "fezandipiti": 413,
    "zoroark": 414,
    "yanmega": 415,
    "vaporeon": 416,
    "jolteon": 417,
    "salazzle": 418,
    "probopass": 419,
    "toucannon": 420,
    "bellibolt": 421,
    "eelektross": 422,
    "mesprit": 423,
    "swalot": 424,
    "meloetta": 425,
    "noivern": 426,
    "oricorio-pa'u": 427,
    "magcargo": 428,
    "qwilfish-hisui": 429,
    "electrode-hisui": 430,
    "braviary": 431,
    "mightyena": 432,
    "rabsca": 433,
    "urshifu": 434,
    "furret": 435,
    "bombirdier": 436,
    "trevenant": 437,
    "persian": 438,
    "whiscash": 439,
    "copperajah": 440,
    "electrode": 441,
    "pachirisu": 442,
    "meganium": 443,
    "dugtrio": 444,
    "muk": 445,
    "dusknoir": 446,
    "magearna-original": 447,
    "clawitzer": 448,
    "luvdisc": 449,
    "spiritomb": 450,
    "girafarig": 451,
    "dachsbun": 452,
    "lumineon": 453,
    "flareon": 454,
    "tauros-paldea-combat": 455,
    "appletun": 456,
    "wigglytuff": 457,
    "leafeon": 458,
    "tatsugiri": 459,
    "vigoroth": 460,
    "ho-oh": 461,
    "dewgong": 462,
    "hariyama": 463,
    "phione": 464,
    "scyther": 465,
    "magmortar": 466,
    "grafaiai": 467,
    "zekrom": 468,
    "duraludon": 469,
    "victreebel": 470,
    "vespiquen": 471,
    "florges": 472,
    "groudon": 473,
    "glalie": 474,
    "dudunsparce": 475,
    "forretress": 476,
    "palossand": 477,
    "tauros-paldea-aqua": 478,
    "deoxys-attack": 479,
    "zacian-crowned": 480,
    "kyogre": 481,
    "gothitelle": 482,
    "delibird": 483,
    "stonjourner": 484,
    "dodrio": 485,
    "delphox": 486,
    "pyroar": 487,
    "mewtwo": 488,
    "zangoose": 489,
    "ursaring": 490,
    "gumshoos": 491,
    "veluza": 492,
    "greedent": 493,
    "ariados": 494,
    "vivillon-polar": 495,
    "eternatus": 496,
    "luxray": 497,
    "arceus-ghost": 498,
    "giratina-origin": 499,
    "oricorio": 500,
    "munkidori": 501,
    "flygon": 502,
    "arbok": 503,
    "wyrdeer": 504,
    "lunala": 505,
    "illumise": 506,
    "regirock": 507,
    "drednaw": 508,
    "azelf": 509,
    "flutter mane": 510,
    "oinkologne-f": 511,
    "bastiodon": 512,
    "golurk": 513,
    "spidops": 514,
    "tropius": 515,
    "drifblim": 516,
    "giratina": 517,
    "dragalge": 518,
    "typhlosion": 519,
    "dipplin": 520,
    "komala": 521,
    "misdreavus": 522,
    "minun": 523,
    "cryogonal": 524,
    "chimecho": 525,
    "venomoth": 526,
    "solgaleo": 527,
    "beartic": 528,
    "cacturne": 529,
    "meowstic-f": 530,
    "noctowl": 531,
    "kricketune": 532,
    "skuntank": 533,
    "zamazenta-crowned": 534,
    "dugtrio-alola": 535,
    "espathra": 536,
    "florges-orange": 537,
    "swanna": 538,
    "lanturn": 539,
    "inteleon": 540,
    "ampharos": 541,
    "passimian": 542,
    "virizion": 543,
    "grumpig": 544,
    "arceus-water": 545,
    "samurott": 546,
    "miraidon": 547,
    "arceus-fire": 548,
    "hypno": 549,
    "alcremie-ruby-swirl": 550,
    "rotom": 551,
    "persian-alola": 552,
    "florges-blue": 553,
    "lycanroc": 554,
    "dedenne": 555,
    "arceus-steel": 556,
    "lugia": 557,
    "honchkrow": 558,
    "palkia-origin": 559,
    "wugtrio": 560,
    "qwilfish": 561,
    "gurdurr": 562,
    "hoopa": 563,
    "alcremie-rainbow-swirl": 564,
    "eiscue": 565,
    "minior-yellow": 566,
    "volbeat": 567,
    "feraligatr": 568,
    "revavroom": 569,
    "bellossom": 570,
    "basculin": 571,
    "koraidon": 572,
    "plusle": 573,
    "klawf": 574,
    "reshiram": 575,
    "raichu": 576,
    "squawkabilly-blue": 577,
    "meowstic": 578,
    "florges-white": 579,
    "granbull": 580,
    "crabominable": 581,
    "seviper": 582,
    "arceus-psychic": 583,
    "froslass": 584,
    "poliwrath": 585,
    "vivillon-river": 586,
    "necrozma-dusk-mane": 587,
    "rotom-mow": 588,
    "tauros": 589,
    "palkia": 590,
    "shaymin": 591,
    "minior-violet": 592,
    "calyrex": 593,
    "cramorant": 594,
    "flapple": 595,
    "emboar": 596,
    "annihilape": 597,
    "alcremie-mint-cream": 598,
    "calyrex-shadow": 599,
    "sandaconda": 600,
    "rayquaza": 601,
    "basculin-blue-striped": 602,
    "alcremie-ruby-cream": 603,
    "arceus-poison": 604,
    "vivillon-high plains": 605,
    "gogoat": 606,
    "sawsbuck-winter": 607,
    "arceus-electric": 608,
    "zarude-dada": 609,
    "sawsbuck-summer": 610,
    "uxie": 611,
    "calyrex-ice": 612,
    "alcremie-caramel-swirl": 613,
    "dialga": 614,
    "alcremie-salted-cream": 615,
    "pikachu-original": 616,
    "dialga-origin": 617,
    "oinkologne": 618,
    "kyurem-white": 619,
    "florges-yellow": 620,
    "sawsbuck": 621,
    "necrozma-dawn-wings": 622,
    "zacian": 623,
    "squawkabilly-yellow": 624,
    "arceus-bug": 625,
    "kyurem-black": 626,
    "arceus-ground": 627,
    "avalugg": 628,
    "vivillon-modern": 629,
    "pikachu-sinnoh": 630,
    "alcremie-lemon-cream": 631,
    "squawkabilly": 632,
    "vivillon-savanna": 633,
    "minior-orange": 634,
    "vivillon-jungle": 635,
    "arceus-dragon": 636,
    "magearna": 637,
    "arceus-fairy": 638,
    "sawsbuck-autumn": 639,
    "arceus-flying": 640,
    "arceus-fighting": 641,
    "vivillon-sun": 642,
    "pikachu-alola": 643,
    "arceus": 644,
    "arceus-rock": 645,
    "squawkabilly-white": 646,
    "pikachu-hoenn": 647,
    "vivillon-marine": 648,
    "arceus-grass": 649,
    "minior-green": 650,
    "vivillon-monsoon": 651,
    "electabuzz": 652,
    "pikachu-kalos": 653,
    "magmar": 654,
    "vivillon-icy snow": 655,
    "arceus-ice": 656,
    "vivillon-garden": 657,
    "pikachu-unova": 658,
    "vivillon-sandstorm": 659,
    "toxtricity-low-key": 660,
    "minior-indigo": 661,
    "eiscue-noice": 662,
    "vivillon-elegant": 663,
    "vivillon-archipelago": 664,
    "vivillon-continental": 665,
    "arceus-dark": 666,
    "alcremie": 667,
    "terapagos-stellar": 668,
    "vivillon": 669
  }
}