{
  "token2id": {
    "<UNK>": 0,
    "fake out": 1,
    "aurora veil": 2,
    "power gem": 3,
    "spiky shield": 4,
    "icy wind": 5,
    "earth power": 6,
    "wood hammer": 7,
    "grassy glide": 8,
    "stealth rock": 9,
    "will-o-wisp": 10,
    "swords dance": 11,
    "protect": 12,
    "parting shot": 13,
    "sucker punch": 14,
    "kowtow cleave": 15,
    "u-turn": 16,
    "knock off": 17,
    "taunt": 18,
    "heat wave": 19,
    "substitute": 20,
    "dazzling gleam": 21,
    "dark pulse": 22,
    "facade": 23,
    "fiery wrath": 24,
    "expanding force": 25,
    "earthquake": 26,
    "seed bomb": 27,
    "trick room": 28,
    "spore": 29,
    "steam eruption": 30,
    "sludge bomb": 31,
    "nasty plot": 32,
    "flare blitz": 33,
    "follow me": 34,
    "ice spinner": 35,
    "extreme speed": 36,
    "sacred sword": 37,
    "flip turn": 38,
    "zen headbutt": 39,
    "snarl": 40,
    "bullet punch": 41,
    "tera blast": 42,
    "air slash": 43,
    "rage powder": 44,
    "life dew": 45,
    "blizzard": 46,
    "matcha gotcha": 47,
    "flash cannon": 48,
    "make it rain": 49,
    "headlong rush": 50,
    "encore": 51,
    "shadow ball": 52,
    "upper hand": 53,
    "high horsepower": 54,
    "pollen puff": 55,
    "gunk shot": 56,
    "drain punch": 57,
    "ivy cudgel": 58,
    "tailwind": 59,
    "eruption": 60,
    "hydro steam": 61,
    "jet punch": 62,
    "draco meteor": 63,
    "dire claw": 64,
    "calm mind": 65,
    "close combat": 66,
    "tachyon cutter": 67,
    "diamond storm": 68,
    "thunderbolt": 69,
    "thunderclap": 70,
    "breaking swipe": 71,
    "mortal spin": 72,
    "spikes": 73,
    "helping hand": 74,
    "quiver dance": 75,
    "moonblast": 76,
    "howl": 77,
    "sandsear storm": 78,
    "horn leech": 79,
    "rock slide": 80,
    "hyper voice": 81,
    "sleep powder": 82,
    "after you": 83,
    "solar blade": 84,
    "surf": 85,
    "hurricane": 86,
    "bleakwind storm": 87,
    "reflect": 88,
    "light screen": 89,
    "poison jab": 90,
    "wide guard": 91,
    "body press": 92,
    "defog": 93,
    "iron defense": 94,
    "salt cure": 95,
    "blood moon": 96,
    "ice beam": 97,
    "recover": 98,
    "shed tail": 99,
    "iron head": 100,
    "simple beam": 101,
    "clangorous soul": 102,
    "liquidation": 103,
    "lunge": 104,
    "psych up": 105,
    "hex": 106,
    "brave bird": 107,
    "dragon claw": 108,
    "beat up": 109,
    "armor cannon": 110,
    "destiny bond": 111,
    "meteor mash": 112,
    "copycat": 113,
    "coaching": 114,
    "feint": 115,
    "acrobatics": 116,
    "foul play": 117,
    "low kick": 118,
    "flame charge": 119,
    "spirit break": 120,
    "hypnosis": 121,
    "crunch": 122,
    "coil": 123,
    "rest": 124,
    "cosmic power": 125,
    "wish": 126,
    "skill swap": 127,
    "gyro ball": 128,
    "icicle crash": 129,
    "ice shard": 130,
    "burning bulwark": 131,
    "gravity": 132,
    "heat crash": 133,
    "dragon pulse": 134,
    "scale shot": 135,
    "ice punch": 136,
    "stomping tantrum": 137,
    "wild charge": 138,
    "weather ball": 139,
    "malignant chain": 140,
    "poison gas": 141,
    "leaf storm": 142,
    "overheat": 143,
    "psychic": 144,
    "thunder wave": 145,
    "lunar blessing": 146,
    "ally switch": 147,
    "fake tears": 148,
    "whirlwind": 149,
    "ruination": 150,
    "power whip": 151,
    "draining kiss": 152,
    "throat chop": 153,
    "steel beam": 154,
    "x-scissor": 155,
    "stone axe": 156,
    "psychic fangs": 157,
    "flamethrower": 158,
    "dragon energy": 159,
    "imprison": 160,
    "brick break": 161,
    "leech life": 162,
    "sticky web": 163,
    "dragon dance": 164,
    "icicle spear": 165,
    "glaive rush": 166,
    "heavy slam": 167,
    "scorching sands": 168,
    "focus energy": 169,
    "payback": 170,
    "freeze-dry": 171,
    "mystical fire": 172,
    "tri attack": 173,
    "eerie impulse": 174,
    "giga drain": 175,
    "meteor beam": 176,
    "instruct": 177,
    "floral healing": 178,
    "discharge": 179,
    "accelerock": 180,
    "volt switch": 181,
    "shelter": 182,
    "toxic": 183,
    "infestation": 184,
    "baneful bunker": 185,
    "dragon darts": 186,
    "shell smash": 187,
    "aura sphere": 188,
    "bug bite": 189,
    "rain dance": 190,
    "electroweb": 191,
    "torch song": 192,
    "power trip": 193,
    "quick guard": 194,
    "play rough": 195,
    "supercell slam": 196,
    "baton pass": 197,
    "overdrive": 198,
    "stored power": 199,
    "haze": 200,
    "trick": 201,
    "mach punch": 202,
    "agility": 203,
    "thunder": 204,
    "muddy water": 205,
    "clear smog": 206,
    "vacuum wave": 207,
    "venoshock": 208,
    "darkest lariat": 209,
    "sludge wave": 210,
    "transform": 211,
    "curse": 212,
    "last respects": 213,
    "night slash": 214,
    "razor shell": 215,
    "ceaseless edge": 216,
    "mighty cleave": 217,
    "thunder punch": 218,
    "swagger": 219,
    "wave crash": 220,
    "scald": 221,
    "solar beam": 222,
    "growth": 223,
    "dragon tail": 224,
    "bulk up": 225,
    "luster purge": 226,
    "pyro ball": 227,
    "yawn": 228,
    "bulldoze": 229,
    "leaf blade": 230,
    "triple axel": 231,
    "stone edge": 232,
    "sunny day": 233,
    "revelation dance": 234,
    "roost": 235,
    "decorate": 236,
    "night shade": 237,
    "aqua jet": 238,
    "psycho cut": 239,
    "avalanche": 240,
    "high jump kick": 241,
    "bitter malice": 242,
    "hammer arm": 243,
    "hydro pump": 244,
    "rapid spin": 245,
    "gigaton hammer": 246,
    "waterfall": 247,
    "explosion": 248,
    "pain split": 249,
    "screech": 250,
    "disable": 251,
    "head smash": 252,
    "flower trick": 253,
    "superpower": 254,
    "roar": 255,
    "endeavor": 256,
    "belly drum": 257,
    "raging bull": 258,
    "sacred fire": 259,
    "phantom force": 260,
    "amnesia": 261,
    "quash": 262,
    "thunderous kick": 263,
    "focus blast": 264,
    "water pledge": 265,
    "hyperspace fury": 266,
    "aerial ace": 267,
    "energy ball": 268,
    "ice fang": 269,
    "heal pulse": 270,
    "psychic noise": 271,
    "hyper beam": 272,
    "toxic spikes": 273,
    "double-edge": 274,
    "zing zap": 275,
    "morning sun": 276,
    "leech seed": 277,
    "outrage": 278,
    "detect": 279,
    "glaciate": 280,
    "fiery dance": 281,
    "court change": 282,
    "snowscape": 283,
    "burning jealousy": 284,
    "endure": 285,
    "scary face": 286,
    "freezing glare": 287,
    "esper wing": 288,
    "clanging scales": 289,
    "strength sap": 290,
    "fire punch": 291,
    "struggle bug": 292,
    "bullet seed": 293,
    "water spout": 294,
    "seed flare": 295,
    "rock tomb": 296,
    "synthesis": 297,
    "struggle": 298
  }
}