{
  "token2id": {
    "<UNK>": 0,
    "ninetales-alola": 1,
    "incineroar": 2,
    "landorus": 3,
    "kingambit": 4,
    "kyurem": 5,
    "rillaboom": 6,
    "gholdengo": 7,
    "glimmora": 8,
    "ogerpon-hearthflame": 9,
    "tornadus": 10,
    "torkoal": 11,
    "grimmsnarl": 12,
    "raging bolt": 13,
    "chi-yu": 14,
    "hatterene": 15,
    "brute bonnet": 16,
    "hoopa-unbound": 17,
    "ursaluna": 18,
    "indeedee-f": 19,
    "volcanion": 20,
    "moltres-galar": 21,
    "sinistcha": 22,
    "roaring moon": 23,
    "dragonite": 24,
    "scizor": 25,
    "arcanine": 26,
    "palafin": 27,
    "chien-pao": 28,
    "palafin-hero": 29,
    "ogerpon-wellspring": 30,
    "okidogi": 31,
    "kommo-o": 32,
    "amoonguss": 33,
    "porygon2": 34,
    "walking wake": 35,
    "jumpluff": 36,
    "lilligant-hisui": 37,
    "diancie": 38,
    "iron crown": 39,
    "regidrago": 40,
    "clefable": 41,
    "sneasler": 42,
    "volcarona": 43,
    "ting-lu": 44,
    "gouging fire": 45,
    "arcanine-hisui": 46,
    "farigiraf": 47,
    "typhlosion-hisui": 48,
    "pelipper": 49,
    "primarina": 50,
    "sinistcha-masterpiece": 51,
    "rhyperior": 52,
    "iron hands": 53,
    "armarouge": 54,
    "tyranitar": 55,
    "garganacl": 56,
    "iron boulder": 57,
    "kleavor": 58,
    "ogerpon-cornerstone": 59,
    "oranguru": 60,
    "ursaluna-bloodmoon": 61,
    "spectrier": 62,
    "landorus-therian": 63,
    "whimsicott": 64,
    "excadrill": 65,
    "orthworm": 66,
    "latios": 67,
    "flamigo": 68,
    "klefki": 69,
    "hitmontop": 70,
    "murkrow": 71,
    "chandelure": 72,
    "zapdos-galar": 73,
    "tsareena": 74,
    "metagross": 75,
    "sylveon": 76,
    "blaziken": 77,
    "lucario": 78,
    "riolu": 79,
    "jirachi": 80,
    "milotic": 81,
    "bronzong": 82,
    "zoroark-hisui": 83,
    "pecharunt": 84,
    "cresselia": 85,
    "ogerpon-hearthflame-tera": 86,
    "garchomp": 87,
    "mew": 88,
    "heatran": 89,
    "sandy shocks": 90,
    "gengar": 91,
    "araquanid": 92,
    "baxcalibur": 93,
    "articuno-galar": 94,
    "stantler": 95,
    "clefairy": 96,
    "registeel": 97,
    "regice": 98,
    "iron valiant": 99,
    "ninetales": 100,
    "breloom": 101,
    "enamorus-therian": 102,
    "thundurus": 103,
    "enamorus": 104,
    "comfey": 105,
    "vikavolt": 106,
    "lycanroc-dusk": 107,
    "ribombee": 108,
    "kilowattrel": 109,
    "rotom-frost": 110,
    "torterra": 111,
    "toxapex": 112,
    "goodra-hisui": 113,
    "terrakion": 114,
    "smeargle": 115,
    "corviknight": 116,
    "dragapult": 117,
    "weezing-galar": 118,
    "golem": 119,
    "houndstone": 120,
    "gallade": 121,
    "hydrapple": 122,
    "skeledirge": 123,
    "scrafty": 124,
    "malamar": 125,
    "hitmonchan": 126,
    "krookodile": 127,
    "talonflame": 128,
    "dudunsparce-*": 129,
    "maushold-four": 130,
    "toxtricity": 131,
    "dudunsparce-three-segment": 132,
    "barraskewda": 133,
    "oricorio-pom-pom": 134,
    "poltchageist": 135,
    "tinkaton": 136,
    "basculegion-f": 137,
    "samurott-hisui": 138,
    "pincurchin": 139,
    "weezing": 140,
    "iron jugulis": 141,
    "iron moth": 142,
    "dondozo": 143,
    "exeggutor-alola": 144,
    "indeedee": 145,
    "lilligant": 146,
    "lapras": 147,
    "charizard": 148,
    "rhydon": 149,
    "venusaur": 150,
    "blastoise": 151,
    "cinderace": 152,
    "serperior": 153,
    "gastrodon": 154,
    "kingdra": 155,
    "thundurus-therian": 156,
    "shiftry": 157,
    "zapdos": 158,
    "salamence": 159,
    "ogerpon-wellspring-tera": 160,
    "weavile": 161,
    "mienshao": 162,
    "toedscruel": 163,
    "empoleon": 164,
    "azumarill": 165,
    "iron bundle": 166,
    "alcremie-matcha-cream": 167,
    "coalossal": 168,
    "slowbro": 169,
    "keldeo": 170,
    "politoed": 171,
    "gyarados": 172,
    "raikou": 173,
    "dusclops": 174,
    "conkeldurr": 175,
    "exeggutor": 176,
    "rotom-fan": 177,
    "yanma": 178,
    "scream tail": 179,
    "sunflora": 180,
    "great tusk": 181,
    "infernape": 182,
    "meowscarada": 183,
    "articuno": 184,
    "avalugg-hisui": 185,
    "suicune": 186,
    "hydreigon": 187,
    "gastrodon-east": 188,
    "tauros-paldea-blaze": 189,
    "entei": 190,
    "sableye": 191,
    "lycanroc-midnight": 192,
    "sudowoodo": 193,
    "bruxish": 194,
    "regigigas": 195,
    "oricorio-sensu": 196,
    "espeon": 197,
    "ceruledge": 198,
    "cetitan": 199,
    "glastrier": 200,
    "gardevoir": 201,
    "slither wing": 202,
    "magnezone": 203,
    "mamoswine": 204,
    "frosmoth": 205,
    "snorlax": 206,
    "perrserker": 207,
    "slaking": 208,
    "deoxys": 209,
    "latias": 210,
    "decidueye-hisui": 211,
    "sneasel-hisui": 212,
    "braviary-hisui": 213,
    "wo-chien": 214,
    "deoxys-defense": 215,
    "umbreon": 216,
    "rotom-wash": 217,
    "abomasnow": 218,
    "regieleki": 219,
    "masquerain": 220,
    "electivire": 221,
    "greninja-*": 222,
    "greninja": 223,
    "shaymin-sky": 224,
    "ogerpon": 225,
    "rampardos": 226
  }
}