{
  "token2id": {
    "<UNK>": 0,
    "stealth rock": 1,
    "earthquake": 2,
    "toxic": 3,
    "knock off": 4,
    "u-turn": 5,
    "make it rain": 6,
    "rock slide": 7,
    "aqua jet": 8,
    "sacred sword": 9,
    "drain punch": 10,
    "substitute": 11,
    "clangorous soulblaze": 12,
    "clanging scales": 13,
    "matcha gotcha": 14,
    "recover": 15,
    "icicle crash": 16,
    "dark pulse": 17,
    "thunderclap": 18,
    "iron defense": 19,
    "surf": 20,
    "calm mind": 21,
    "overheat": 22,
    "salt cure": 23,
    "body press": 24,
    "strange steam": 25,
    "close combat": 26,
    "swords dance": 27,
    "shadow claw": 28,
    "play rough": 29,
    "protect": 30,
    "encore": 31,
    "shadow sneak": 32,
    "liquidation": 33,
    "bulk up": 34,
    "foul play": 35,
    "hammer arm": 36,
    "scald": 37,
    "dragon tail": 38,
    "scale shot": 39,
    "heavy slam": 40,
    "icicle spear": 41,
    "water shuriken": 42,
    "energy ball": 43,
    "ice beam": 44,
    "flip turn": 45,
    "roost": 46,
    "ivy cudgel": 47,
    "horn leech": 48,
    "luster purge": 49,
    "mirror coat": 50,
    "flamethrower": 51,
    "stone edge": 52,
    "bloom doom": 53,
    "zen headbutt": 54,
    "teleport": 55,
    "volt switch": 56,
    "hydro pump": 57,
    "wish": 58,
    "defog": 59,
    "psyshock": 60,
    "sludge bomb": 61,
    "hurricane": 62,
    "psychic noise": 63,
    "leaf blade": 64,
    "bug buzz": 65,
    "smart strike": 66,
    "night slash": 67,
    "moonblast": 68,
    "iron head": 69,
    "strength sap": 70,
    "diamond storm": 71,
    "ice shard": 72,
    "pyro ball": 73,
    "court change": 74,
    "draco meteor": 75,
    "aurora veil": 76,
    "black hole eclipse": 77,
    "facade": 78,
    "psychic": 79,
    "blaze kick": 80,
    "endure": 81,
    "thunderbolt": 82,
    "spikes": 83,
    "brave bird": 84,
    "reversal": 85,
    "thunder wave": 86,
    "rapid spin": 87,
    "headlong rush": 88,
    "giga drain": 89,
    "trick room": 90,
    "king's shield": 91,
    "sucker punch": 92,
    "earth power": 93,
    "lunar dance": 94,
    "mist ball": 95,
    "dazzling gleam": 96,
    "tachyon cutter": 97,
    "ceaseless edge": 98,
    "aqua cutter": 99,
    "solar beam": 100,
    "glare": 101,
    "weather ball": 102,
    "dragon dance": 103,
    "charge beam": 104,
    "air slash": 105,
    "thunder punch": 106,
    "wood hammer": 107,
    "mystical fire": 108,
    "future sight": 109,
    "twinkle tackle": 110,
    "healing wish": 111,
    "high horsepower": 112,
    "poltergeist": 113,
    "flare blitz": 114,
    "grassy glide": 115,
    "bonemerang": 116,
    "bullet punch": 117,
    "crunch": 118,
    "tera starstorm": 119,
    "sludge wave": 120,
    "quick attack": 121,
    "return": 122,
    "taunt": 123,
    "dual wingbeat": 124,
    "continental crush": 125,
    "ice spinner": 126,
    "shadow ball": 127,
    "razor shell": 128,
    "haze": 129,
    "draining kiss": 130,
    "dragon pulse": 131,
    "fake out": 132,
    "whirlwind": 133,
    "agility": 134,
    "hex": 135,
    "shattered psyche": 136,
    "extrasensory": 137,
    "rock tomb": 138,
    "nuzzle": 139,
    "devastating drake": 140,
    "leech seed": 141,
    "triple axel": 142,
    "power-up punch": 143,
    "freeze-dry": 144,
    "surging strikes": 145,
    "heat wave": 146,
    "trick": 147,
    "brick break": 148,
    "fire punch": 149,
    "tri attack": 150,
    "hidden power": 151,
    "roar": 152,
    "sticky web": 153,
    "ice punch": 154,
    "expanding force": 155,
    "seismic toss": 156,
    "hyperspace fury": 157,
    "power whip": 158,
    "bitter blade": 159,
    "never-ending nightmare": 160,
    "superpower": 161,
    "rising voltage": 162,
    "hyper voice": 163,
    "ice fang": 164,
    "synthesis": 165,
    "will-o-wisp": 166,
    "nasty plot": 167,
    "all-out pummeling": 168,
    "malignant chain": 169,
    "parting shot": 170,
    "slack off": 171,
    "poison jab": 172,
    "fiery dance": 173,
    "tail glow": 174,
    "ruination": 175,
    "whirlpool": 176,
    "shell smash": 177,
    "focus blast": 178,
    "magma storm": 179,
    "explosion": 180,
    "stored power": 181,
    "endeavor": 182,
    "leaf storm": 183,
    "avalanche": 184,
    "rain dance": 185,
    "bolt beak": 186,
    "toxic spikes": 187,
    "quiver dance": 188,
    "eruption": 189,
    "fickle beam": 190,
    "pursuit": 191,
    "dragon claw": 192,
    "reflect": 193,
    "outrage": 194,
    "light screen": 195,
    "heal bell": 196,
    "discharge": 197,
    "fire blast": 198,
    "plasma fists": 199,
    "chilly reception": 200,
    "low kick": 201,
    "vacuum wave": 202,
    "throat chop": 203,
    "destiny bond": 204,
    "flower trick": 205,
    "work up": 206,
    "fishious rend": 207,
    "hail": 208,
    "waterfall": 209,
    "gunk shot": 210,
    "meteor beam": 211,
    "aura sphere": 212,
    "z-mirror move": 213,
    "corkscrew crash": 214,
    "supersonic skystrike": 215,
    "acrobatics": 216,
    "double iron bash": 217,
    "flash cannon": 218,
    "first impression": 219,
    "high jump kick": 220,
    "grass knot": 221,
    "sleep powder": 222,
    "fire fang": 223,
    "v-create": 224,
    "steel beam": 225,
    "alluring voice": 226,
    "yawn": 227,
    "frustration": 228,
    "bleakwind storm": 229,
    "head smash": 230,
    "rest": 231,
    "rock polish": 232,
    "sleep talk": 233,
    "gyro ball": 234,
    "skill swap": 235,
    "extreme speed": 236,
    "spirit break": 237,
    "thunder": 238,
    "gigavolt havoc": 239,
    "blizzard": 240,
    "bolt strike": 241,
    "perish song": 242,
    "mean look": 243,
    "z-conversion": 244,
    "secret sword": 245,
    "moonlight": 246,
    "memento": 247,
    "hone claws": 248,
    "psycho cut": 249,
    "stone axe": 250,
    "hydro vortex": 251,
    "payback": 252,
    "pain split": 253,
    "scorching sands": 254,
    "tectonic rage": 255,
    "triple arrows": 256,
    "leech life": 257,
    "torch song": 258,
    "z-celebrate": 259,
    "volt tackle": 260,
    "spore": 261,
    "dragon energy": 262,
    "curse": 263,
    "power gem": 264,
    "metal burst": 265,
    "belly drum": 266,
    "breakneck blitz": 267,
    "double-edge": 268,
    "body slam": 269,
    "mortal spin": 270,
    "struggle": 271,
    "cosmic power": 272,
    "psywave": 273,
    "counter": 274,
    "trailblaze": 275,
    "lovely kiss": 276,
    "clangorous soul": 277,
    "z-hypnosis": 278,
    "electro shot": 279,
    "clear smog": 280,
    "supercell slam": 281,
    "soft-boiled": 282,
    "ancient power": 283,
    "steam eruption": 284,
    "anchor shot": 285,
    "night shade": 286,
    "revival blessing": 287,
    "aromatherapy": 288,
    "tidy up": 289,
    "power trip": 290,
    "lash out": 291,
    "savage spin-out": 292,
    "temper flare": 293,
    "fly": 294,
    "searing shot": 295,
    "baneful bunker": 296,
    "subzero slammer": 297,
    "misty explosion": 298,
    "lunge": 299,
    "magnet rise": 300,
    "flame charge": 301,
    "bite": 302,
    "population bomb": 303,
    "stun spore": 304,
    "nature's madness": 305,
    "z-happy hour": 306,
    "gravity": 307,
    "aura wheel": 308,
    "wave crash": 309,
    "psychic fangs": 310,
    "fiery wrath": 311,
    "super fang": 312,
    "boomburst": 313,
    "rock blast": 314,
    "mighty cleave": 315,
    "blue flare": 316,
    "conversion": 317,
    "pin missile": 318,
    "autotomize": 319,
    "inferno overdrive": 320,
    "bullet seed": 321,
    "mach punch": 322,
    "bounce": 323,
    "hypnosis": 324,
    "amnesia": 325,
    "steel roller": 326,
    "morning sun": 327,
    "growth": 328,
    "lava plume": 329,
    "chilling water": 330,
    "cotton guard": 331,
    "flail": 332,
    "solar blade": 333,
    "petal blizzard": 334,
    "drill run": 335,
    "genesis supernova": 336,
    "reflect type": 337,
    "gigaton hammer": 338,
    "disable": 339,
    "double shock": 340
  }
}