{
  "token2id": {
    "<UNK>": 0,
    "zapdos-galar": 1,
    "slowking": 2,
    "sinistcha": 3,
    "goodra-hisui": 4,
    "iron moth": 5,
    "garchomp": 6,
    "ribombee": 7,
    "raging bolt": 8,
    "gholdengo": 9,
    "enamorus": 10,
    "ogerpon-wellspring": 11,
    "great tusk": 12,
    "rillaboom": 13,
    "serperior": 14,
    "heatran": 15,
    "zamazenta-*": 16,
    "zamazenta": 17,
    "darkrai": 18,
    "zapdos": 19,
    "tyranitar": 20,
    "arcanine-hisui": 21,
    "ninetales-alola": 22,
    "weezing-galar": 23,
    "klefki": 24,
    "maushold-four": 25,
    "latias": 26,
    "okidogi": 27,
    "kyurem": 28,
    "torkoal": 29,
    "scovillain": 30,
    "walking wake": 31,
    "hatterene": 32,
    "ceruledge": 33,
    "iron valiant": 34,
    "iron treads": 35,
    "dragonite": 36,
    "deoxys-speed": 37,
    "glimmora": 38,
    "kingambit": 39,
    "blastoise": 40,
    "volcanion": 41,
    "haxorus": 42,
    "frosmoth": 43,
    "pincurchin": 44,
    "raichu-alola": 45,
    "iron hands": 46,
    "rotom-wash": 47,
    "pawmot": 48,
    "clodsire": 49,
    "toxapex": 50,
    "corviknight": 51,
    "dondozo": 52,
    "clefable": 53,
    "gliscor": 54,
    "dragapult": 55,
    "cinderace": 56,
    "alomomola": 57,
    "ting-lu": 58,
    "ditto": 59,
    "landorus-therian": 60,
    "talonflame": 61,
    "blissey": 62,
    "araquanid": 63,
    "excadrill": 64,
    "chesnaught": 65,
    "tornadus-therian": 66,
    "hoopa-unbound": 67,
    "pecharunt": 68,
    "primarina": 69,
    "indeedee": 70,
    "hitmonlee": 71,
    "iron crown": 72,
    "polteageist-antique": 73,
    "tinkaton": 74,
    "ogerpon": 75,
    "hydreigon": 76,
    "samurott-hisui": 77,
    "pelipper": 78,
    "toxicroak": 79,
    "floatzel": 80,
    "mamoswine": 81,
    "slowking-galar": 82,
    "cetitan": 83,
    "meowscarada": 84,
    "tsareena": 85,
    "vikavolt": 86,
    "crawdaunt": 87,
    "scizor": 88,
    "skarmory": 89,
    "barraskewda": 90,
    "kingdra": 91,
    "raikou": 92,
    "manaphy": 93,
    "empoleon": 94,
    "bronzong": 95,
    "venusaur": 96,
    "lilligant-hisui": 97,
    "minior-blue": 98,
    "staraptor": 99,
    "galvantula": 100,
    "salamence": 101,
    "ninetales": 102,
    "kleavor": 103,
    "brambleghast": 104,
    "moltres": 105,
    "sandy shocks": 106,
    "latios": 107,
    "iron jugulis": 108,
    "greninja-*": 109,
    "greninja": 110,
    "abomasnow": 111,
    "scream tail": 112,
    "hawlucha": 113,
    "armarouge": 114,
    "weavile": 115,
    "cloyster": 116,
    "sandslash-alola": 117,
    "wo-chien": 118,
    "ogerpon-teal-tera": 119,
    "porygon-z": 120,
    "lokix": 121,
    "golduck": 122,
    "tentacruel": 123,
    "zarude": 124,
    "keldeo-resolute": 125,
    "amoonguss": 126,
    "overqwil": 127,
    "articuno-galar": 128,
    "blaziken": 129,
    "zoroark-hisui": 130,
    "polteageist": 131,
    "metagross": 132,
    "lucario": 133,
    "espeon": 134,
    "gardevoir": 135,
    "cinccino": 136,
    "garganacl": 137,
    "magnezone": 138,
    "ursaluna": 139,
    "conkeldurr": 140,
    "keldeo": 141,
    "cresselia": 142,
    "hydrapple": 143,
    "jirachi": 144,
    "ogerpon-wellspring-tera": 145,
    "kommo-o": 146,
    "grimmsnarl": 147,
    "glaceon": 148,
    "cobalion": 149,
    "moltres-galar": 150,
    "ogerpon-cornerstone": 151,
    "thundurus-therian": 152,
    "fezandipiti": 153,
    "charizard": 154,
    "zoroark": 155,
    "muk-alola": 156,
    "regidrago": 157,
    "rhyperior": 158,
    "mudsdale": 159,
    "yanmega": 160,
    "mandibuzz": 161,
    "typhlosion-hisui": 162,
    "vaporeon": 163,
    "sylveon": 164,
    "jolteon": 165,
    "umbreon": 166,
    "salazzle": 167,
    "milotic": 168,
    "skeledirge": 169,
    "probopass": 170,
    "toucannon": 171,
    "quaquaval": 172,
    "rotom-heat": 173,
    "incineroar": 174,
    "azumarill": 175,
    "swampert": 176,
    "slowbro": 177,
    "iron boulder": 178,
    "comfey": 179,
    "whimsicott": 180,
    "bellibolt": 181,
    "porygon2": 182,
    "sinistcha-masterpiece": 183,
    "maushold": 184,
    "lycanroc-midnight": 185,
    "eelektross": 186,
    "mesprit": 187,
    "slither wing": 188,
    "swalot": 189,
    "gallade": 190,
    "breloom": 191,
    "meloetta": 192,
    "farigiraf": 193,
    "reuniclus": 194,
    "exeggutor": 195,
    "slowbro-galar": 196,
    "diancie": 197,
    "lilligant": 198,
    "brute bonnet": 199,
    "deoxys-defense": 200,
    "entei": 201,
    "kilowattrel": 202,
    "politoed": 203,
    "ludicolo": 204,
    "noivern": 205,
    "leavanny": 206,
    "hippowdon": 207,
    "mimikyu": 208,
    "houndoom": 209,
    "cyclizar": 210
  }
}