{
  "token2id": {
    "<UNK>": 0,
    "high horsepower": 1,
    "volt switch": 2,
    "icy wind": 3,
    "fake out": 4,
    "draco meteor": 5,
    "yawn": 6,
    "toxic": 7,
    "triple axel": 8,
    "play rough": 9,
    "heavy slam": 10,
    "energy ball": 11,
    "light screen": 12,
    "thunder wave": 13,
    "infestation": 14,
    "muddy water": 15,
    "rock slide": 16,
    "stomping tantrum": 17,
    "spirit break": 18,
    "wildbolt storm": 19,
    "psycho cut": 20,
    "giga impact": 21,
    "recover": 22,
    "protect": 23,
    "hurricane": 24,
    "diamond storm": 25,
    "iron head": 26,
    "trick room": 27,
    "waterfall": 28,
    "body press": 29,
    "shell smash": 30,
    "hydro pump": 31,
    "power gem": 32,
    "sticky web": 33,
    "knock off": 34,
    "tailwind": 35,
    "lunge": 36,
    "decorate": 37,
    "extreme speed": 38,
    "wood hammer": 39,
    "sucker punch": 40,
    "close combat": 41,
    "spacial rend": 42,
    "calm mind": 43,
    "brave bird": 44,
    "moonblast": 45,
    "follow me": 46,
    "flip turn": 47,
    "heal pulse": 48,
    "pollen puff": 49,
    "flare blitz": 50,
    "electroweb": 51,
    "thunderbolt": 52,
    "luster purge": 53,
    "alluring voice": 54,
    "last respects": 55,
    "poltergeist": 56,
    "salt cure": 57,
    "breaking swipe": 58,
    "power whip": 59,
    "substitute": 60,
    "sludge bomb": 61,
    "bitter blade": 62,
    "psychic": 63,
    "triple arrows": 64,
    "body slam": 65,
    "leaf blade": 66,
    "headlong rush": 67,
    "scald": 68,
    "electro drift": 69,
    "tidy up": 70,
    "ice beam": 71,
    "population bomb": 72,
    "heat wave": 73,
    "hyperspace fury": 74,
    "ice hammer": 75,
    "ruination": 76,
    "will-o-wisp": 77,
    "focus blast": 78,
    "helping hand": 79,
    "throat chop": 80,
    "revival blessing": 81,
    "taunt": 82,
    "double shock": 83,
    "matcha gotcha": 84,
    "nasty plot": 85,
    "iron defense": 86,
    "fiery wrath": 87,
    "tri attack": 88,
    "hyper voice": 89,
    "air slash": 90,
    "parting shot": 91,
    "phantom force": 92,
    "swords dance": 93,
    "malignant chain": 94,
    "shadow ball": 95,
    "ice punch": 96,
    "encore": 97,
    "mud shot": 98,
    "fire blast": 99,
    "flash cannon": 100,
    "howl": 101,
    "coaching": 102,
    "blizzard": 103,
    "double-edge": 104,
    "wave crash": 105,
    "tera blast": 106,
    "quiver dance": 107,
    "bug buzz": 108,
    "bug bite": 109,
    "toxic spikes": 110,
    "aura wheel": 111,
    "drain punch": 112,
    "roost": 113,
    "super fang": 114,
    "flower trick": 115,
    "avalanche": 116,
    "bullet seed": 117,
    "dragon dance": 118,
    "liquidation": 119,
    "tail glow": 120,
    "reflect": 121,
    "dazzling gleam": 122,
    "boomburst": 123,
    "spiky shield": 124,
    "aurora veil": 125,
    "rock polish": 126,
    "shadow force": 127,
    "shadow sneak": 128,
    "no retreat": 129,
    "drill run": 130,
    "superpower": 131,
    "strength sap": 132,
    "giga drain": 133,
    "gunk shot": 134,
    "sleep powder": 135,
    "dark pulse": 136,
    "grav apple": 137,
    "imprison": 138,
    "transform": 139,
    "struggle": 140,
    "circle throw": 141,
    "crunch": 142,
    "u-turn": 143,
    "apple acid": 144,
    "kowtow cleave": 145,
    "rage powder": 146,
    "acrobatics": 147,
    "spore": 148,
    "sludge wave": 149,
    "cosmic power": 150,
    "moongeist beam": 151,
    "stun spore": 152,
    "baneful bunker": 153,
    "leech seed": 154,
    "draining kiss": 155,
    "fusion bolt": 156,
    "dragon claw": 157,
    "wide guard": 158,
    "scale shot": 159,
    "first impression": 160,
    "stealth rock": 161,
    "facade": 162,
    "icicle crash": 163,
    "poison jab": 164,
    "earth power": 165,
    "judgment": 166,
    "ice shard": 167,
    "revelation dance": 168,
    "leaf storm": 169,
    "torch song": 170,
    "slack off": 171,
    "coil": 172,
    "icicle spear": 173,
    "earthquake": 174,
    "lunar blessing": 175,
    "meteor beam": 176,
    "photon geyser": 177,
    "dragon energy": 178,
    "water spout": 179,
    "grass knot": 180,
    "wicked blow": 181,
    "sacred sword": 182,
    "vacuum wave": 183,
    "shed tail": 184,
    "flamethrower": 185,
    "dragon darts": 186,
    "whirlwind": 187,
    "overheat": 188,
    "stone edge": 189,
    "poison gas": 190,
    "burning bulwark": 191,
    "heat crash": 192,
    "spirit shackle": 193,
    "thunder": 194,
    "nuzzle": 195,
    "freezing glare": 196,
    "psystrike": 197,
    "struggle bug": 198,
    "sacred fire": 199,
    "seed bomb": 200,
    "esper wing": 201,
    "rain dance": 202,
    "dire claw": 203,
    "foul play": 204,
    "thunderous kick": 205,
    "snarl": 206,
    "dragon tail": 207,
    "flame charge": 208,
    "sunsteel strike": 209,
    "aqua cutter": 210,
    "aura sphere": 211,
    "blue flare": 212,
    "solar beam": 213,
    "make it rain": 214,
    "freeze-dry": 215,
    "expanding force": 216,
    "precipice blades": 217,
    "tail slap": 218,
    "steam eruption": 219,
    "night shade": 220,
    "trick": 221,
    "aeroblast": 222,
    "dragon pulse": 223,
    "eruption": 224,
    "psycho boost": 225,
    "instruct": 226,
    "bulk up": 227,
    "rage fist": 228,
    "syrup bomb": 229,
    "ice spinner": 230,
    "acid spray": 231,
    "mach punch": 232,
    "aqua jet": 233,
    "wild charge": 234,
    "agility": 235,
    "tachyon cutter": 236,
    "life dew": 237,
    "head smash": 238,
    "dynamic punch": 239,
    "thunder punch": 240,
    "mystical power": 241,
    "electro shot": 242,
    "clear smog": 243,
    "mystical fire": 244,
    "overdrive": 245,
    "belly drum": 246,
    "leech life": 247,
    "shell side arm": 248,
    "baton pass": 249,
    "psychic fangs": 250,
    "mist ball": 251,
    "thunderclap": 252,
    "razor shell": 253,
    "low kick": 254,
    "soft-boiled": 255,
    "accelerock": 256,
    "fleur cannon": 257,
    "blood moon": 258,
    "curse": 259,
    "rock blast": 260,
    "raging bull": 261,
    "springtide storm": 262,
    "lash out": 263,
    "hyperspace hole": 264,
    "pyro ball": 265,
    "synthesis": 266,
    "low sweep": 267,
    "rapid spin": 268,
    "surf": 269,
    "bitter malice": 270,
    "rest": 271,
    "behemoth blade": 272,
    "ivy cudgel": 273,
    "bolt strike": 274,
    "night slash": 275,
    "crabhammer": 276,
    "psyshock": 277,
    "dual wingbeat": 278,
    "quick attack": 279,
    "armor cannon": 280,
    "clangorous soul": 281,
    "recycle": 282,
    "feint": 283,
    "psychic noise": 284,
    "glacial lance": 285,
    "dynamax cannon": 286,
    "victory dance": 287,
    "collision course": 288,
    "tera starstorm": 289,
    "aqua step": 290,
    "volt tackle": 291,
    "lumina crash": 292,
    "dragon ascent": 293,
    "floral healing": 294,
    "x-scissor": 295,
    "stone axe": 296,
    "charm": 297,
    "grassy glide": 298,
    "glaciate": 299,
    "endeavor": 300,
    "mortal spin": 301,
    "fickle beam": 302,
    "disable": 303,
    "glare": 304,
    "fire punch": 305,
    "psyblade": 306,
    "mighty cleave": 307,
    "bleakwind storm": 308,
    "explosion": 309,
    "horn leech": 310,
    "seed flare": 311,
    "jet punch": 312,
    "secret sword": 313,
    "relic song": 314,
    "fiery dance": 315,
    "haze": 316,
    "astral barrage": 317,
    "hammer arm": 318,
    "bullet punch": 319,
    "fusion flare": 320,
    "megahorn": 321,
    "cross chop": 322,
    "origin pulse": 323,
    "high jump kick": 324,
    "clanging scales": 325,
    "final gambit": 326,
    "scorching sands": 327,
    "hyper drill": 328,
    "incinerate": 329,
    "zen headbutt": 330,
    "shore up": 331,
    "ceaseless edge": 332,
    "shadow claw": 333,
    "spikes": 334,
    "brick break": 335,
    "jungle healing": 336,
    "weather ball": 337,
    "rock tomb": 338,
    "meteor mash": 339,
    "sandsear storm": 340,
    "hypnosis": 341,
    "burning jealousy": 342,
    "acid armor": 343,
    "take heart": 344,
    "gigaton hammer": 345,
    "glaive rush": 346,
    "dragon rush": 347,
    "string shot": 348,
    "moonlight": 349,
    "wish": 350,
    "surging strikes": 351,
    "morning sun": 352,
    "fire fang": 353,
    "shift gear": 354,
    "quash": 355,
    "temper flare": 356,
    "court change": 357,
    "swift": 358
  }
}