{
  "token2id": {
    "<UNK>": 0,
    "slaking": 1,
    "thundurus-therian": 2,
    "hitmontop": 3,
    "toxapex": 4,
    "scovillain": 5,
    "lycanroc-midnight": 6,
    "tatsugiri": 7,
    "goodra-hisui": 8,
    "dachsbun": 9,
    "grimmsnarl": 10,
    "entei": 11,
    "veluza": 12,
    "diancie": 13,
    "kommo-o": 14,
    "gyarados": 15,
    "magcargo": 16,
    "noivern": 17,
    "blissey": 18,
    "jirachi": 19,
    "lurantis": 20,
    "breloom": 21,
    "iron bundle": 22,
    "regirock": 23,
    "smeargle": 24,
    "hitmonlee": 25,
    "masquerain": 26,
    "spidops": 27,
    "ho-oh": 28,
    "meowscarada": 29,
    "sudowoodo": 30,
    "palkia-origin": 31,
    "espeon": 32,
    "altaria": 33,
    "electabuzz": 34,
    "palafin": 35,
    "vespiquen": 36,
    "iron valiant": 37,
    "palafin-hero": 38,
    "florges-orange": 39,
    "gothitelle": 40,
    "latios": 41,
    "barraskewda": 42,
    "basculegion-f": 43,
    "pikachu-kalos": 44,
    "ceruledge": 45,
    "incineroar": 46,
    "goodra": 47,
    "tropius": 48,
    "decidueye-hisui": 49,
    "forretress": 50,
    "scream tail": 51,
    "garganacl": 52,
    "baxcalibur": 53,
    "regigigas": 54,
    "iron crown": 55,
    "mamoswine": 56,
    "great tusk": 57,
    "clefable": 58,
    "crabominable": 59,
    "skeledirge": 60,
    "vaporeon": 61,
    "ariados": 62,
    "suicune": 63,
    "drednaw": 64,
    "miraidon": 65,
    "maushold-four": 66,
    "magmar": 67,
    "chimecho": 68,
    "deoxys-defense": 69,
    "ting-lu": 70,
    "pawmot": 71,
    "sinistcha-masterpiece": 72,
    "milotic": 73,
    "hoopa-unbound": 74,
    "snorlax": 75,
    "toxicroak": 76,
    "bronzong": 77,
    "dragapult": 78,
    "granbull": 79,
    "porygon-z": 80,
    "pecharunt": 81,
    "moltres-galar": 82,
    "plusle": 83,
    "sylveon": 84,
    "oricorio-sensu": 85,
    "lycanroc": 86,
    "toedscruel": 87,
    "drifblim": 88,
    "feraligatr": 89,
    "mew": 90,
    "arcanine-hisui": 91,
    "basculegion": 92,
    "archaludon": 93,
    "glaceon": 94,
    "zacian": 95,
    "ambipom": 96,
    "volcarona": 97,
    "swampert": 98,
    "landorus-therian": 99,
    "hoopa": 100,
    "eelektross": 101,
    "pyroar": 102,
    "scyther": 103,
    "dondozo": 104,
    "wugtrio": 105,
    "leavanny": 106,
    "clodsire": 107,
    "skarmory": 108,
    "armarouge": 109,
    "morpeko": 110,
    "toucannon": 111,
    "avalugg": 112,
    "copperajah": 113,
    "klefki": 114,
    "manaphy": 115,
    "spectrier": 116,
    "chesnaught": 117,
    "dudunsparce-three-segment": 118,
    "regidrago": 119,
    "sandslash-alola": 120,
    "ninetales-alola": 121,
    "flapple": 122,
    "cobalion": 123,
    "galvantula": 124,
    "giratina-origin": 125,
    "dodrio": 126,
    "rhyperior": 127,
    "deoxys-speed": 128,
    "indeedee-f": 129,
    "greninja": 130,
    "vivillon-icy snow": 131,
    "magnezone": 132,
    "venomoth": 133,
    "noctowl": 134,
    "registeel": 135,
    "bellossom": 136,
    "regice": 137,
    "jolteon": 138,
    "chi-yu": 139,
    "banette": 140,
    "meloetta": 141,
    "gardevoir": 142,
    "probopass": 143,
    "mudsdale": 144,
    "appletun": 145,
    "sandy shocks": 146,
    "poliwrath": 147,
    "carbink": 148,
    "mightyena": 149,
    "kingambit": 150,
    "primarina": 151,
    "bruxish": 152,
    "iron moth": 153,
    "lunala": 154,
    "jumpluff": 155,
    "eternatus": 156,
    "alcremie-matcha-cream": 157,
    "volcanion": 158,
    "fezandipiti": 159,
    "comfey": 160,
    "vileplume": 161,
    "kyurem-black": 162,
    "flamigo": 163,
    "rhydon": 164,
    "garchomp": 165,
    "bastiodon": 166,
    "haxorus": 167,
    "chandelure": 168,
    "palossand": 169,
    "staraptor": 170,
    "heracross": 171,
    "empoleon": 172,
    "lapras": 173,
    "salazzle": 174,
    "honchkrow": 175,
    "clefairy": 176,
    "samurott-hisui": 177,
    "glastrier": 178,
    "arceus-ice": 179,
    "muk-alola": 180,
    "oricorio-pom-pom": 181,
    "wigglytuff": 182,
    "metagross": 183,
    "lokix": 184,
    "donphan": 185,
    "virizion": 186,
    "cacturne": 187,
    "oinkologne": 188,
    "sandaconda": 189,
    "ursaluna": 190,
    "houndoom": 191,
    "whimsicott": 192,
    "roaring moon": 193,
    "frosmoth": 194,
    "oranguru": 195,
    "amoonguss": 196,
    "arceus-psychic": 197,
    "gliscor": 198,
    "duraludon": 199,
    "cresselia": 200,
    "houndstone": 201,
    "excadrill": 202,
    "hydreigon": 203,
    "terapagos": 204,
    "talonflame": 205,
    "abomasnow": 206,
    "kyogre": 207,
    "necrozma": 208,
    "golduck": 209,
    "venusaur": 210,
    "urshifu": 211,
    "murkrow": 212,
    "chien-pao": 213,
    "dialga": 214,
    "grumpig": 215,
    "okidogi": 216,
    "revavroom": 217,
    "sceptile": 218,
    "landorus": 219,
    "walking wake": 220,
    "keldeo-resolute": 221,
    "munkidori": 222,
    "blaziken": 223,
    "muk": 224,
    "victreebel": 225,
    "infernape": 226,
    "flygon": 227,
    "gouging fire": 228,
    "charizard": 229,
    "decidueye": 230,
    "arceus-fairy": 231,
    "zamazenta-crowned": 232,
    "swanna": 233,
    "mandibuzz": 234,
    "gallade": 235,
    "shiftry": 236,
    "conkeldurr": 237,
    "delphox": 238,
    "rillaboom": 239,
    "scrafty": 240,
    "azumarill": 241,
    "weavile": 242,
    "minun": 243,
    "articuno-galar": 244,
    "mewtwo": 245,
    "hitmonchan": 246,
    "arceus-rock": 247,
    "bombirdier": 248,
    "dragonite": 249,
    "stonjourner": 250,
    "porygon2": 251,
    "vivillon-garden": 252,
    "floatzel": 253,
    "seviper": 254,
    "darkrai": 255,
    "brute bonnet": 256,
    "farigiraf": 257,
    "luvdisc": 258,
    "braviary-hisui": 259,
    "mesprit": 260,
    "magearna": 261,
    "crawdaunt": 262,
    "iron leaves": 263,
    "zebstrika": 264,
    "heatran": 265,
    "dialga-origin": 266,
    "mabosstiff": 267,
    "kingdra": 268,
    "sneasler": 269,
    "samurott": 270,
    "zapdos-galar": 271,
    "arbok": 272,
    "umbreon": 273,
    "meganium": 274,
    "oricorio": 275,
    "thundurus": 276,
    "kricketune": 277,
    "tauros-paldea-aqua": 278,
    "emboar": 279,
    "solgaleo": 280,
    "dugtrio-alola": 281,
    "regieleki": 282,
    "delibird": 283,
    "reshiram": 284,
    "magearna-original": 285,
    "tyranitar": 286,
    "tauros": 287,
    "torkoal": 288,
    "politoed": 289,
    "malamar": 290,
    "coalossal": 291,
    "gholdengo": 292,
    "magmortar": 293,
    "golem": 294,
    "cinccino": 295,
    "indeedee": 296,
    "tinkaton": 297,
    "mismagius": 298,
    "tornadus": 299,
    "groudon": 300,
    "sinistcha": 301,
    "illumise": 302,
    "iron jugulis": 303,
    "reuniclus": 304,
    "lugia": 305,
    "typhlosion": 306,
    "calyrex-shadow": 307,
    "greedent": 308,
    "ninetales": 309,
    "deoxys-attack": 310,
    "zangoose": 311,
    "serperior": 312,
    "perrserker": 313,
    "kyurem-white": 314,
    "vivillon-modern": 315,
    "mimikyu": 316,
    "arcanine": 317,
    "qwilfish": 318,
    "vigoroth": 319,
    "necrozma-dawn-wings": 320,
    "blastoise": 321,
    "annihilape": 322,
    "dusknoir": 323,
    "wo-chien": 324,
    "corviknight": 325,
    "cryogonal": 326,
    "golem-alola": 327,
    "alomomola": 328,
    "iron hands": 329,
    "inteleon": 330,
    "dipplin": 331,
    "spiritomb": 332,
    "sunflora": 333,
    "vikavolt": 334,
    "hippowdon": 335,
    "lilligant": 336,
    "gengar": 337,
    "meowstic-f": 338,
    "rotom-mow": 339,
    "arceus-fire": 340,
    "terrakion": 341,
    "shaymin-sky": 342,
    "alcremie-mint-cream": 343,
    "cloyster": 344,
    "leafeon": 345,
    "zapdos": 346,
    "calyrex": 347,
    "luxray": 348,
    "golurk": 349,
    "zarude-dada": 350,
    "torterra": 351,
    "uxie": 352,
    "ursaluna-bloodmoon": 353,
    "grafaiai": 354,
    "pincurchin": 355,
    "slither wing": 356,
    "ogerpon-cornerstone": 357,
    "lanturn": 358,
    "articuno": 359,
    "cyclizar": 360,
    "clawitzer": 361,
    "araquanid": 362,
    "pikachu-unova": 363,
    "vivillon-sandstorm": 364,
    "quagsire": 365,
    "bellibolt": 366,
    "hatterene": 367,
    "gastrodon-east": 368,
    "enamorus": 369,
    "eiscue": 370,
    "toxtricity-low-key": 371,
    "azelf": 372,
    "slowbro-galar": 373,
    "zekrom": 374,
    "ampharos": 375,
    "swalot": 376,
    "raging bolt": 377,
    "latias": 378,
    "dewgong": 379,
    "maushold": 380,
    "komala": 381,
    "iron treads": 382,
    "persian": 383,
    "electrode-hisui": 384,
    "beartic": 385,
    "phione": 386,
    "lycanroc-dusk": 387,
    "rotom-heat": 388,
    "polteageist-antique": 389,
    "braviary": 390,
    "deoxys": 391,
    "flareon": 392,
    "hawlucha": 393,
    "avalugg-hisui": 394,
    "sableye": 395,
    "oinkologne-f": 396,
    "tauros-paldea-combat": 397,
    "slowbro": 398,
    "camerupt": 399,
    "furret": 400,
    "raichu": 401,
    "cinderace": 402,
    "florges": 403,
    "electrode": 404,
    "hypno": 405,
    "ditto": 406,
    "tsareena": 407,
    "weezing-galar": 408,
    "exeggutor-alola": 409,
    "lucario": 410,
    "passimian": 411,
    "cramorant": 412,
    "overqwil": 413,
    "zacian-crowned": 414,
    "florges-blue": 415,
    "scizor": 416,
    "rabsca": 417,
    "falinks": 418,
    "alcremie-lemon-cream": 419,
    "raikou": 420,
    "gumshoos": 421,
    "basculin": 422,
    "kyurem": 423,
    "froslass": 424,
    "dudunsparce": 425,
    "hydrapple": 426,
    "rotom": 427,
    "koraidon": 428,
    "trevenant": 429,
    "hariyama": 430,
    "calyrex-ice": 431,
    "qwilfish-hisui": 432,
    "rotom-wash": 433,
    "skuntank": 434,
    "orthworm": 435,
    "lilligant-hisui": 436,
    "ludicolo": 437,
    "yanmega": 438,
    "iron thorns": 439,
    "ogerpon": 440,
    "minior-indigo": 441,
    "lumineon": 442,
    "espathra": 443,
    "quaquaval": 444,
    "pikachu-alola": 445,
    "rayquaza": 446,
    "urshifu-rapid-strike": 447,
    "mienshao": 448,
    "sandslash": 449,
    "flutter mane": 450,
    "glalie": 451,
    "arboliva": 452,
    "kleavor": 453,
    "slowking-galar": 454,
    "krookodile": 455,
    "whiscash": 456,
    "raichu-alola": 457,
    "minior-yellow": 458,
    "salamence": 459,
    "glimmora": 460,
    "eiscue-noice": 461,
    "volbeat": 462,
    "ribombee": 463,
    "alcremie-caramel-swirl": 464,
    "squawkabilly-white": 465,
    "pachirisu": 466,
    "tauros-paldea-blaze": 467,
    "florges-white": 468,
    "kilowattrel": 469,
    "rampardos": 470,
    "arceus-poison": 471,
    "electivire": 472,
    "polteageist": 473,
    "vivillon-elegant": 474,
    "dragalge": 475,
    "iron boulder": 476,
    "tornadus-therian": 477,
    "klawf": 478,
    "wyrdeer": 479,
    "dugtrio": 480,
    "giratina": 481,
    "rotom-fan": 482,
    "oricorio-pa'u": 483,
    "sawsbuck-winter": 484,
    "shaymin": 485,
    "alcremie-ruby-swirl": 486,
    "palkia": 487,
    "gogoat": 488,
    "pikachu-original": 489,
    "tentacruel": 490,
    "vivillon-sun": 491,
    "minior-blue": 492,
    "slowking": 493,
    "rotom-frost": 494,
    "necrozma-dusk-mane": 495,
    "basculin-blue-striped": 496,
    "cetitan": 497,
    "meowstic": 498,
    "sawsbuck-autumn": 499,
    "pikachu-hoenn": 500,
    "toxtricity": 501,
    "brambleghast": 502,
    "enamorus-therian": 503,
    "medicham": 504,
    "vivillon-archipelago": 505,
    "dedenne": 506,
    "weezing": 507,
    "gastrodon": 508,
    "zamazenta": 509,
    "squawkabilly": 510,
    "persian-alola": 511,
    "pelipper": 512,
    "ogerpon-wellspring": 513,
    "arceus-fighting": 514,
    "vivillon-continental": 515,
    "moltres": 516,
    "arceus-bug": 517,
    "arceus-dark": 518,
    "vivillon-polar": 519,
    "alcremie-rainbow-swirl": 520,
    "florges-yellow": 521,
    "arceus-electric": 522,
    "arceus-water": 523,
    "typhlosion-hisui": 524,
    "squawkabilly-blue": 525,
    "squawkabilly-yellow": 526,
    "alcremie": 527,
    "ogerpon-hearthflame": 528,
    "sawsbuck-summer": 529,
    "sawsbuck": 530,
    "terapagos-terastal": 531,
    "terapagos-stellar": 532,
    "exeggutor": 533,
    "arceus-dragon": 534,
    "arceus-steel": 535,
    "minior": 536,
    "arceus-ghost": 537,
    "zarude": 538,
    "vivillon": 539,
    "arceus-ground": 540,
    "vivillon-marine": 541,
    "alcremie-ruby-cream": 542
  }
}