{
  "token2id": {
    "<UNK>": 0,
    "sticky web": 1,
    "scald": 2,
    "moonblast": 3,
    "psyshock": 4,
    "skill swap": 5,
    "calm mind": 6,
    "dragon pulse": 7,
    "dragon tail": 8,
    "focus blast": 9,
    "earth power": 10,
    "knock off": 11,
    "thunderbolt": 12,
    "thunderclap": 13,
    "earthquake": 14,
    "bulk up": 15,
    "stealth rock": 16,
    "swords dance": 17,
    "spikes": 18,
    "ivy cudgel": 19,
    "close combat": 20,
    "will-o-wisp": 21,
    "heavy slam": 22,
    "roost": 23,
    "volt switch": 24,
    "hex": 25,
    "flare blitz": 26,
    "ice fang": 27,
    "aurora veil": 28,
    "defog": 29,
    "reflect": 30,
    "light screen": 31,
    "agility": 32,
    "strange steam": 33,
    "stored power": 34,
    "trick": 35,
    "aura sphere": 36,
    "encore": 37,
    "trailblaze": 38,
    "thunder wave": 39,
    "population bomb": 40,
    "dragon dance": 41,
    "icicle spear": 42,
    "rapid spin": 43,
    "ice spinner": 44,
    "fiery dance": 45,
    "tera blast": 46,
    "shadow ball": 47,
    "flamethrower": 48,
    "matcha gotcha": 49,
    "draco meteor": 50,
    "make it rain": 51,
    "misty terrain": 52,
    "freeze-dry": 53,
    "tidy up": 54,
    "bite": 55,
    "steam eruption": 56,
    "substitute": 57,
    "poltergeist": 58,
    "toxic": 59,
    "hydro pump": 60,
    "nuzzle": 61,
    "supercell slam": 62,
    "protect": 63,
    "ice punch": 64,
    "drain punch": 65,
    "quiver dance": 66,
    "poison jab": 67,
    "ice beam": 68,
    "revival blessing": 69,
    "recover": 70,
    "psychic noise": 71,
    "growth": 72,
    "giga drain": 73,
    "bitter blade": 74,
    "u-turn": 75,
    "hydro steam": 76,
    "mystical fire": 77,
    "kowtow cleave": 78,
    "dragon darts": 79,
    "court change": 80,
    "payback": 81,
    "pyro ball": 82,
    "scale shot": 83,
    "body slam": 84,
    "nasty plot": 85,
    "seismic toss": 86,
    "fling": 87,
    "wish": 88,
    "gunk shot": 89,
    "high horsepower": 90,
    "rest": 91,
    "infestation": 92,
    "haze": 93,
    "sleep talk": 94,
    "dazzling gleam": 95,
    "body press": 96,
    "bleakwind storm": 97,
    "heat wave": 98,
    "synthesis": 99,
    "sucker punch": 100,
    "struggle": 101,
    "psychic": 102,
    "solar blade": 103,
    "foul play": 104,
    "dark pulse": 105,
    "stone edge": 106,
    "draining kiss": 107,
    "mortal spin": 108,
    "flip turn": 109,
    "iron head": 110,
    "head smash": 111,
    "taunt": 112,
    "grassy glide": 113,
    "discharge": 114,
    "headlong rush": 115,
    "teleport": 116,
    "expanding force": 117,
    "shell smash": 118,
    "stun spore": 119,
    "psycho boost": 120,
    "aqua jet": 121,
    "malignant chain": 122,
    "ceaseless edge": 123,
    "parting shot": 124,
    "wave crash": 125,
    "ice shard": 126,
    "chilly reception": 127,
    "roar": 128,
    "low kick": 129,
    "ruination": 130,
    "magma storm": 131,
    "rock slide": 132,
    "extreme speed": 133,
    "toxic spikes": 134,
    "blizzard": 135,
    "pain split": 136,
    "soft-boiled": 137,
    "icicle crash": 138,
    "hurricane": 139,
    "flower trick": 140,
    "triple axel": 141,
    "sludge bomb": 142,
    "iron defense": 143,
    "flash cannon": 144,
    "surf": 145,
    "weather ball": 146,
    "liquidation": 147,
    "hyperspace fury": 148,
    "take heart": 149,
    "power whip": 150,
    "shadow sneak": 151,
    "whirlwind": 152,
    "thunderous kick": 153,
    "superpower": 154,
    "crunch": 155,
    "brave bird": 156,
    "lava plume": 157,
    "moonlight": 158,
    "sludge wave": 159,
    "sunny day": 160,
    "acrobatics": 161,
    "curse": 162,
    "waterfall": 163,
    "fire punch": 164,
    "overheat": 165,
    "outrage": 166,
    "endeavor": 167,
    "stone axe": 168,
    "healing wish": 169,
    "rock tomb": 170,
    "bullet punch": 171,
    "tachyon cutter": 172,
    "quick attack": 173,
    "leech seed": 174,
    "wood hammer": 175,
    "stomping tantrum": 176,
    "sparkling aria": 177,
    "boomburst": 178,
    "future sight": 179,
    "endure": 180,
    "whirlpool": 181,
    "razor shell": 182,
    "horn leech": 183,
    "play rough": 184,
    "victory dance": 185,
    "vacuum wave": 186,
    "thief": 187,
    "seed bomb": 188,
    "strength sap": 189,
    "steel beam": 190,
    "aqua cutter": 191,
    "water shuriken": 192,
    "mean look": 193,
    "secret sword": 194,
    "leech life": 195,
    "psychic fangs": 196,
    "leaf storm": 197,
    "zen headbutt": 198,
    "belly drum": 199,
    "power trip": 200,
    "bullet seed": 201,
    "salt cure": 202,
    "brick break": 203,
    "gigaton hammer": 204,
    "ice hammer": 205,
    "scorching sands": 206,
    "facade": 207,
    "acid spray": 208,
    "acid armor": 209,
    "armor cannon": 210,
    "breaking swipe": 211,
    "double-edge": 212,
    "thunder": 213,
    "clangorous soul": 214,
    "mirror coat": 215,
    "luster purge": 216,
    "spirit break": 217,
    "fiery wrath": 218,
    "meteor beam": 219,
    "detect": 220,
    "fire blast": 221,
    "energy ball": 222,
    "glare": 223,
    "jungle healing": 224,
    "trick room": 225,
    "destiny bond": 226,
    "poison fang": 227,
    "dragon energy": 228,
    "high jump kick": 229,
    "gravity": 230,
    "power gem": 231,
    "bug buzz": 232,
    "eruption": 233,
    "alluring voice": 234,
    "chilling water": 235,
    "hyper voice": 236,
    "torch song": 237,
    "aqua step": 238,
    "tailwind": 239,
    "grass knot": 240,
    "fickle beam": 241,
    "fire fang": 242,
    "clear smog": 243,
    "hammer arm": 244,
    "beat up": 245,
    "fire spin": 246,
    "icy wind": 247,
    "dragon claw": 248,
    "phantom force": 249,
    "dual wingbeat": 250,
    "psychic terrain": 251,
    "magnet rise": 252,
    "throat chop": 253,
    "first impression": 254,
    "slack off": 255,
    "misty explosion": 256,
    "mighty cleave": 257,
    "soak": 258,
    "wild charge": 259,
    "hyper beam": 260,
    "rock blast": 261,
    "smack down": 262,
    "temper flare": 263,
    "sacred sword": 264,
    "lunar dance": 265,
    "fake out": 266,
    "lunge": 267,
    "flying press": 268,
    "bulldoze": 269,
    "shell side arm": 270,
    "psycho cut": 271,
    "leaf blade": 272,
    "avalanche": 273,
    "solar beam": 274,
    "tail glow": 275,
    "sacred fire": 276,
    "tickle": 277,
    "snowscape": 278,
    "focus punch": 279,
    "crabhammer": 280,
    "flame charge": 281
  }
}